[
  {
    "id": 1,
    "entryNumber": "00001",
    "artist": "Fleetwood Mac",
    "album": "Tusk",
    "yearReleased": "1979",
    "genre": "Rock",
    "subGenre": "AOR",
    "image": "fmtusk.png",
    "puremood": "Radio",
    "season": "Spring",
    "party": "No",
    "lyric": "I have always been a storm",
    "review": "This is, at the time, the biggest band attempting to experiment with their sound. It's a perfect example of artistic integrity being chaotically held within the frame of being the biggest band in the world. It's somehow a post-punk album that was raised by standard album-oriented rock music, who got to visit Uncle Byrne and Aunt Cocaine on the weekends. Stressful but peaceful like a hurricane on a paradisiacal island.\n\nIt starts out unassuming with \"Over & Over,\" which sounds exactly like sitting in an old person's Mercury Grand Prix with the air conditioning blowing. That old person is your grandmother, and you are waiting for her to finish up at the yard sale on a Sunday afternoon. The day is filled with suburban adventure, and maybe you'll get some Red Lobster after it's over.\n\nI try to imagine a Rumors fan putting this album on and going from \"Over & Over\" to \"The Ledge\" and hearing what sounds like a Daniel Johnston pop shop, then throwing the album in the trash. There isn't a wasted second on this thing when it comes to oddness. It's pop/soft rock adjacent. I doubt even the band knew it at that time. Just a bunch of sex freaks from the UK and the US trying to follow up one of the biggest albums ever.\n\nCome to think of it, the entire album sort of oozes this quality, the air conditioner/grandma rubric I served up earlier. Remember? Anyway, it's a sort of safety that only a guy who loves powdery drugs and the Talking Heads, and a band game for anything can present to you. I know a lot of folk will often talk ad nauseum about Fleetwood Mac's friction as a band based on their promiscuity toward each other, but none of that comes through for me on this album. This album feels like a band trying to expand with the times and somehow sounding bright and clean.\n\nI don't know, man, I've been thinking about this album for years. It's my all-time favorite.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Over & Over",
        "writer": "Christine McVie",
        "duration": "4:34"
      },
      {
        "trackNumber": 2,
        "trackName": "The Ledge",
        "writer": "Lindsey Buckingham",
        "duration": "2:08"
      },
      {
        "trackNumber": 3,
        "trackName": "Think About Me",
        "writer": "Christine McVie",
        "duration": "2:44"
      },
      {
        "trackNumber": 4,
        "trackName": "Save Me a Place",
        "writer": "Lindsey Buckingham",
        "duration": "2:42"
      },
      {
        "trackNumber": 5,
        "trackName": "Sara",
        "writer": "Stevie Nicks",
        "duration": "6:22"
      },
      {
        "trackNumber": 6,
        "trackName": "What Makes You Think You're the One",
        "writer": "Lindsey Buckingham",
        "duration": "3:32"
      },
      {
        "trackNumber": 7,
        "trackName": "Storms",
        "writer": "Stevie Nicks",
        "duration": "5:31"
      },
      {
        "trackNumber": 8,
        "trackName": "That's All for Everyone",
        "writer": "Lindsey Buckingham",
        "duration": "3:03"
      },
      {
        "trackNumber": 9,
        "trackName": "Not That Funny",
        "writer": "Lindsey Buckingham",
        "duration": "3:11"
      },
      {
        "trackNumber": 10,
        "trackName": "Sisters of the Moon",
        "writer": "Stevie Nicks",
        "duration": "4:42"
      },
      {
        "trackNumber": 11,
        "trackName": "Angel",
        "writer": "Stevie Nicks",
        "duration": "4:54"
      },
      {
        "trackNumber": 12,
        "trackName": "That's Enough for Me",
        "writer": "Lindsey Buckingham",
        "duration": "1:50"
      },
      {
        "trackNumber": 13,
        "trackName": "Brown Eyes",
        "writer": "Christine McVie",
        "duration": "4:27"
      },
      {
        "trackNumber": 14,
        "trackName": "Never Make Me Cry",
        "writer": "Christine McVie",
        "duration": "2:18"
      },
      {
        "trackNumber": 15,
        "trackName": "I Know I'm Not Wrong",
        "writer": "Lindsey Buckingham",
        "duration": "3:05"
      },
      {
        "trackNumber": 16,
        "trackName": "Honey Hi",
        "writer": "Christine McVie",
        "duration": "2:41"
      },
      {
        "trackNumber": 17,
        "trackName": "Beautiful Child",
        "writer": "Stevie Nicks",
        "duration": "5:21"
      },
      {
        "trackNumber": 18,
        "trackName": "Walk a Thin Line",
        "writer": "Lindsey Buckingham",
        "duration": "3:46"
      },
      {
        "trackNumber": 19,
        "trackName": "Tusk",
        "writer": "Lindsey Buckingham",
        "duration": "3:37"
      },
      {
        "trackNumber": 20,
        "trackName": "Never Forget",
        "writer": "Christine McVie",
        "duration": "3:34"
      }
    ]
  },
  {
    "id": 2,
    "entryNumber": "00002",
    "artist": "The Replacements",
    "album": "Let It Be",
    "yearReleased": "1984",
    "genre": "Punk",
    "subGenre": "Power Pop, College Rock",
    "image": "replacementslet.jpg",
    "puremood": "Basement",
    "season": "Summer",
    "party": "Yes",
    "lyric": "How do you say you're okay to an answering machine?",
    "review": "One of the funniest things I have ever read in a book was in the Replacements biography Troubled Boys. Maybe I'll tell you about it one day. Ok, I'll tell you now. Paul Westerberg, 1/4th of the Troubled Boys and all-around genius, talks about a time he was at Prince's recording studio and Ray Charles' daughter stopped by for one reason or another. He struck up a conversation and mentioned that he had been working on a song that he thought her father, Ray Charles, would be a good fit for. He continues to pitch the idea to her, and the entire time, she is uncomfortable with the entire idea. So Paul decides to drop it and on the day goes. Later that night, he recalls, he was in a bar bathroom and it clicked why Ray Charles' daughter seemed so turned off with the idea of her father performing a song he wrote: the song in question was called \"They're Blind\". And if you don't get why that is funny, then you need to go to Ray Charles' school. And if you are currently in Ray Charles' school and you're still having trouble comprehending why that anecdote is hilarious, then I would like to speak with the teaching administration; they are not doing their job. The Replacements are my favorite band of all time. Have been for a while. And before that, they were ONE of my favorite bands of all time. I think they got the top place when I realized I love an underdog story. I love Tom Scharlping of The Best Show fame, who is the champion underdog. I love the New Pornographers song Ballad of a Comeback Kid because it conveys the true spirit of an underdog fighting their way through adversity and maybe they don't reach the end goal, but they sure as hell didn't go out like a bitch. I love hot dogs. I love dogs. I didn't know this growing up at all, but a couple of years ago, I found out my dad's favorite band is The Replacements as well, so all the more reason to keep them at the top spot. I think The Mats embody the American spirit of being born in a country that, albeit is pretty great at times but sure can be tough for a lot of folk right out the gate. They should have been the biggest band in the world or at least the biggest band in the 80's but they couldn't get out of their own way. But I guess that's the true underdog spirit, I guess. Sometimes the underdog doesn't know how far they can go until it's too late and they are asking the daughter of one of the greatest musicians of all time if their blind father wanted to song about being blind. Funny guys. Amazing band. Go listen to Let It Be by The Mats.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "I Will Dare",
        "writer": "Paul Westerberg",
        "duration": "3:18"
      },
      {
        "trackNumber": 2,
        "trackName": "Favorite Thing",
        "writer": "Westerberg, Tommy Stinson, Bob Stinson, Chris Mars",
        "duration": "2:19"
      },
      {
        "trackNumber": 3,
        "trackName": "We're Comin' Out",
        "writer": "Westerberg, Stinson, Stinson, Mars",
        "duration": "2:21"
      },
      {
        "trackNumber": 4,
        "trackName": "Tommy Gets His Tonsils Out",
        "writer": "Westerberg, Stinson, Stinson, Mars",
        "duration": "1:53"
      },
      {
        "trackNumber": 5,
        "trackName": "Androgynous",
        "writer": "Westerberg",
        "duration": "3:11"
      },
      {
        "trackNumber": 6,
        "trackName": "Black Diamond",
        "writer": "Paul Stanley",
        "duration": "2:40"
      },
      {
        "trackNumber": 7,
        "trackName": "Unsatisfied",
        "writer": "Westerberg",
        "duration": "4:01"
      },
      {
        "trackNumber": 8,
        "trackName": "Seen Your Video",
        "writer": "Westerberg",
        "duration": "3:08"
      },
      {
        "trackNumber": 9,
        "trackName": "Gary's Got a Boner",
        "writer": "Westerberg, Stinson, Stinson, Mars, Ted Nugent",
        "duration": "2:28"
      },
      {
        "trackNumber": 10,
        "trackName": "Sixteen Blue",
        "writer": "Westerberg",
        "duration": "4:24"
      },
      {
        "trackNumber": 11,
        "trackName": "Answering Machine",
        "writer": "Westerberg",
        "duration": "3:40"
      }
    ]
  },
  {
    "id": 3,
    "entryNumber": "00003",
    "artist": "Big Star",
    "album": "Radio City",
    "yearReleased": "1974",
    "genre": "Power Pop",
    "subGenre": "Rock",
    "image": "bigstarradio.jpg",
    "puremood": "Radio",
    "season": "Spring",
    "party": "Yes",
    "lyric": "And why don't you come on back from way out west and love me, we can work out the rest",
    "review": "I am starting to notice a trend in some of my favorite albums ever: underdogs. Big Star is no exception. They made three truly perfect records; one of their members died in a car accident after releasing a truly near-perfect album, and then Alex Chilton became a really weird guy and started washing dishes in New Orleans. Then he died. Then another died. We all die, I suppose. Well, not me. I'm gonna live forever. A lot of people will tell you that the first Big Star album, #1 Record, is their best. Again, it's perfect, but Radio City is more perfect. Twelve wonderful, truly breathtaking Power Pop songs made before Power Pop was a thing. And on top of that, a hot contender for one of the ten best songs ever is on this thing. If you have listened to September Gurls, you know what I mean. I feel like I am a small-time grocery store clerk with big dreams and aspirations when I listen to this thing. I clock out at 9 pm on a Friday night, get into my friend's rusted-out Chevy, he hands me a beer, and we go look for a place with hot babes. The guitar tone on here is the most satisfying jangle ever put to tape, sounding like a patio beer or falling in love for the first time. The energy put into this thing and the low reception it got on release really make you admire the fight these guys had to have had to continue on and make a really weird but very perfect third album (minus 2 members) aptly titled Third/Sister Lovers. If you need a pick-me-up, this is the band and THIS is THE album.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "O My Soul",
        "writer": "Alex Chilton",
        "duration": "5:40"
      },
      {
        "trackNumber": 2,
        "trackName": "Life Is White",
        "writer": "Chilton, Andy Hummel",
        "duration": "3:19"
      },
      {
        "trackNumber": 3,
        "trackName": "Way Out West",
        "writer": "Hummel",
        "duration": "2:50"
      },
      {
        "trackNumber": 4,
        "trackName": "What's Going Ahn",
        "writer": "Chilton, Hummel",
        "duration": "2:40"
      },
      {
        "trackNumber": 5,
        "trackName": "You Get What You Deserve",
        "writer": "Chilton",
        "duration": "3:08"
      },
      {
        "trackNumber": 6,
        "trackName": "Mod Lang",
        "writer": "Chilton, Richard Rosebrough",
        "duration": "2:45"
      },
      {
        "trackNumber": 7,
        "trackName": "Back of a Car",
        "writer": "Chilton, Hummel",
        "duration": "2:46"
      },
      {
        "trackNumber": 8,
        "trackName": "Daisy Glaze",
        "writer": "Chilton, Hummel, Jody Stephens",
        "duration": "3:49"
      },
      {
        "trackNumber": 9,
        "trackName": "She's a Mover",
        "writer": "Chilton",
        "duration": "3:12"
      },
      {
        "trackNumber": 10,
        "trackName": "September Gurls",
        "writer": "Chilton",
        "duration": "2:49"
      },
      {
        "trackNumber": 11,
        "trackName": "Morpha Too",
        "writer": "Chilton",
        "duration": "1:27"
      },
      {
        "trackNumber": 12,
        "trackName": "I'm in Love with a Girl",
        "writer": "Chilton",
        "duration": "1:48"
      }
    ]
  },
  {
    "id": 4,
    "entryNumber": "00004",
    "artist": "Talking Heads",
    "album": "Remain in Light",
    "yearReleased": "1980",
    "genre": "New Wave",
    "subGenre": "Art Rock, Post Punk",
    "image": "TalkingHeadsRemaininLight.jpg",
    "puremood": "Lab",
    "season": "Spring",
    "party": "Yes",
    "lyric": "For a long time I felt without style or grace wearing shoes with no socks in cold weather",
    "review": "I could give you 500 years and a Spotify premium membership, and I doubt you'll find a better album opener than \"AH!\" The only other opening line I can think of right now is \"...and then we all bought yaaaaaaaachts\" from Highly Refined Pirates by Minus the Bear. And David Byrne doing his best half-assed impression of Kathy from the hit newspaper comic strip \"Kathy\" still wins from a \"brevity is the soul of wit\" kind of place. My first experience with Talking Heads was Napster. I was in high school, and I was going through my mandatory Radiohead phase. This was before Radiohead did the Bomb the Music Industry model of pay anything, so I had to download all of the songs I wanted when the titles looked like an Aphex Twin tracklist. I suppose any Talking Heads fan can guess where this is going: they have a song called Radio Head, Radiohead's band name is Radiohead... you get it. So naturally, that is the first Talking Heads song I remember hearing. A fine start, I suppose. It wasn't until a bit later in life that I actually sat my Radiohead ass down and listened. I am pretty sure I spent a summer listening to the aforementioned Remain in Light, Speaking in Tongues, Fear of Music, et al., and every note on these albums still sounds so fresh to this day. Not to mention the fact that just hearing David Byrne's voice at any point immediately puts me in a great puremood. His direct, reading a newspaper delivery is built into my bones. Good band.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Born Under Punches (The Heat Goes On)",
        "writer": "Byrne, Eno, Frantz, Harrison, Weymouth",
        "duration": "5:49"
      },
      {
        "trackNumber": 2,
        "trackName": "Crosseyed and Painless",
        "writer": "Byrne, Eno, Frantz, Harrison, Weymouth",
        "duration": "4:48"
      },
      {
        "trackNumber": 3,
        "trackName": "The Great Curve",
        "writer": "Byrne, Eno, Frantz, Harrison, Weymouth",
        "duration": "6:28"
      },
      {
        "trackNumber": 4,
        "trackName": "Once in a Lifetime",
        "writer": "Byrne, Eno, Frantz, Harrison, Weymouth",
        "duration": "4:19"
      },
      {
        "trackNumber": 5,
        "trackName": "Houses in Motion",
        "writer": "Byrne, Eno, Frantz, Harrison, Weymouth",
        "duration": "4:33"
      },
      {
        "trackNumber": 6,
        "trackName": "Seen and Not Seen",
        "writer": "Byrne, Eno, Frantz, Harrison, Weymouth",
        "duration": "3:25"
      },
      {
        "trackNumber": 7,
        "trackName": "Listening Wind",
        "writer": "Byrne, Eno, Frantz, Harrison, Weymouth",
        "duration": "4:43"
      },
      {
        "trackNumber": 8,
        "trackName": "The Overload",
        "writer": "Byrne, Eno, Frantz, Harrison, Weymouth",
        "duration": "6:25"
      }
    ]
  },
  {
    "id": 5,
    "entryNumber": "00005",
    "artist": "Huerco S.",
    "album": "For Those Of You Who Have Never...",
    "yearReleased": "2016",
    "genre": "Ambient",
    "subGenre": "Electronic",
    "image": "huercos.jpg",
    "puremood": "Airport",
    "season": "Winter",
    "party": "No",
    "lyric": "------",
    "review": "I am sometimes guilty of hearing an album I like and proclaiming it as one of the all-time greats. I don't know, blame it on needing something or someone to love me back, or blame it on 38 years of trying to figure out a way to wrap my bones and skin around a certain sound or album. Maybe blame it on the rain, maybe not—blame it on the rain... Maybe fuck yaself. (Reviewer's note: 'Blame It On The Rain' is a 1989 song by the pop group Milli Vanilli, who were outed to be lip-syncing all of their music. But the best fact about them is that when I googled this song to get the year released, the genres were listed as R&B, Soul, and Halloween Music.) Anyway, I say all of this because this was very much one of these types of albums. I put this on while playing PGA2K22 one Sunday afternoon in between Gravediggaz's '6 Feet Deep' and some Steve Roach album about space or the weather and was completely taken over by how warm and mysterious this project was. This is an album I for sure tried to fit my bones and skin around and instead, the dang album decided to mutate with my entire being. I distinctly remember going back again and again and again to restart the album only to finally just double-tap the button on Spotify to play it on repeat. Since then, I have walked to work in 20-degree weather to this album, I have lied in bed daydreaming about anything in the world to this album... I have even run to this album which is truly psychotic. It may not be for people who have yet accepted ambient music as a genre (I am terrified of my friend TJ listening to this, who is one of the greatest people ever but has yet to come to the side of ambient being an essential genre) but if you have a taste for wavy, warm, deep, and sounds that make you blame everything on the rain for making you like ambient, then you'll love this son of a bitch.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "A Sea of Love",
        "writer": "Leeds",
        "duration": "7:18"
      },
      {
        "trackNumber": 2,
        "trackName": "Lifeblood (Naïve Melody)",
        "writer": "Leeds",
        "duration": "8:13"
      },
      {
        "trackNumber": 3,
        "trackName": "Hear Me Out",
        "writer": "Leeds",
        "duration": "6:07"
      },
      {
        "trackNumber": 4,
        "trackName": "Kraanvogel",
        "writer": "Leeds",
        "duration": "5:39"
      },
      {
        "trackNumber": 5,
        "trackName": "On the Embankment",
        "writer": "Leeds",
        "duration": "5:57"
      },
      {
        "trackNumber": 6,
        "trackName": "Marked for Life",
        "writer": "Leeds",
        "duration": "3:41"
      },
      {
        "trackNumber": 7,
        "trackName": "Cubist Camouflage",
        "writer": "Leeds",
        "duration": "2:41"
      },
      {
        "trackNumber": 8,
        "trackName": "Promises of Fertility",
        "writer": "Leeds",
        "duration": "6:56"
      },
      {
        "trackNumber": 9,
        "trackName": "The Sacred Dance",
        "writer": "Leeds",
        "duration": "6:07"
      }
    ]
  },
  {
    "id": 6,
    "entryNumber": "00006",
    "artist": "The New Pornographers",
    "album": "Mass Romantic",
    "yearReleased": "2000",
    "genre": "Power Pop",
    "subGenre": "Indie Rock",
    "image": "massromantic.jpg",
    "puremood": "Bedroom",
    "season": "Spring",
    "party": "Yes",
    "lyric": "For the love of a god, you say not a letter from an occupant",
    "review": "You know what? Lets try something. I am gonna have ChatGPT write this review for me. So here we go: ChatGPT: Oh no, you've put me in quite the predicament! As much as I'd love to dive into writing a review for \"Mass Romantic\" by The New Pornographers, I'm afraid my talents are more suited to generating text rather than reviewing albums. But fear not, I'm here to help in any other way you need, whether it's offering insights, answering questions, or providing a bit of entertainment! Ok, never mind. Mass Romantic was not my first New Pornos album. That honor goes to Electric Version. I bought it at Best Buy (along with Hail to the Thief by Radiohead) based on the album cover. Maybe I saw a review for it on AllMusic (shoutout Hollywood Steve) or Pitchfork (shoutout Conde Nast), but either way, I do remember it being an impulse buy to some degree. My next listen was the album after The Electric Version which was called Twin Cinema. This was when I started to think this band was on to something. Two amazing albums in a row? Two albums with a little house around them? Okay! So after a bit of searching, I learned they had an album before all of them: Mass Romantic. And the album cover was scandalous. You can't beat that. I will admit, it did not connect with me at first blush, but that feeling didn't last very long. This album is for those looking for a band that sounds so hungry and writes hooks that are so catchy... well, I guess there is a fish metaphor I can fit into this? I don't feel like it. Hold on one sec: ChatGPT: Leave me alone I am watching Deadwood lol.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Mass Romantic",
        "writer": "Newman",
        "duration": "4:11"
      },
      {
        "trackNumber": 2,
        "trackName": "The Fake Headlines",
        "writer": "Newman",
        "duration": "2:45"
      },
      {
        "trackNumber": 3,
        "trackName": "The Slow Descent into Alcoholism",
        "writer": "Newman",
        "duration": "3:56"
      },
      {
        "trackNumber": 4,
        "trackName": "Mystery Hours",
        "writer": "Newman",
        "duration": "3:11"
      },
      {
        "trackNumber": 5,
        "trackName": "Jackie",
        "writer": "Bejar",
        "duration": "2:46"
      },
      {
        "trackNumber": 6,
        "trackName": "Letter from an Occupant",
        "writer": "Newman",
        "duration": "3:46"
      },
      {
        "trackNumber": 7,
        "trackName": "To Wild Homes",
        "writer": "Bejar, Newman",
        "duration": "3:33"
      },
      {
        "trackNumber": 8,
        "trackName": "The Body Says No",
        "writer": "Newman",
        "duration": "3:56"
      },
      {
        "trackNumber": 9,
        "trackName": "Execution Day",
        "writer": "Bejar",
        "duration": "2:59"
      },
      {
        "trackNumber": 10,
        "trackName": "Centre for Holy Wars",
        "writer": "Newman",
        "duration": "3:06"
      },
      {
        "trackNumber": 11,
        "trackName": "The Mary Martin Show",
        "writer": "Newman",
        "duration": "3:19"
      },
      {
        "trackNumber": 12,
        "trackName": "Breakin' the Law",
        "writer": "Bejar",
        "duration": "3:27"
      }
    ]
  },
  {
    "id": 7,
    "entryNumber": "00007",
    "artist": "Television",
    "album": "Marquee Moon",
    "yearReleased": "1977",
    "genre": "Rock",
    "subGenre": "Post Punk",
    "image": "marqueemoon.jpg",
    "puremood": "Basement",
    "season": "Summer",
    "party": "Yes",
    "lyric": "Then Richie, Richie said: Hey man, let's dress up like cops, think of what we could do",
    "review": "These days, there are tons of bands that deliberately try to make it impossible to search for them on Google. Real Estate, !!!, Tennis, Perfect Pussy (that last one is a tough one to explain to your family). To this day, I am hard pressed to understand why outside of trying to sound cool. But what's less cool than trying to dodge people trying to find tour dates when they can just type 'Man Man band' and find it easy. (funny story: I googled 'bands with hard names to search for' for this and accidentally searched for 'beans* with hard names to search for' and now I am looking at an AllRecipes article about types of beans. Did you know it was NOT spelled Kid Knee Bean??!). So, Television. If I type that into a search engine, I get Best Buy and Amazon ads about the newest flat as hell and bigger than all of Lord's creation for sale for $10,000 dollars. But Television to me is a band so ahead of its time, they could be mistaken for the new post-rock revival. Seriously, try it. Find a friend who doesn't know who Television is and say 'bro this is the new up and coming rock group. They are gonna blow your mind. They are called Ham Salad.' Ok Enough farting around. Television is incredible. At least this album is. I do very much like their other albums but this one is close proof that God exists and he is alright with a member named Richard Hell (sorry for cursing again) once being in the band. Maybe he decided to work at sending his God-like magic to the band after Richard Hell (sorry for cursing again) left. Who knows. I am not a Priest (another good impossible search engine band). Either way, this is a band for everyone. They lie in a middle ground where jaded dorks like me and the rest of the non-jaded cool people out there can enjoy it all the same. Seriously, try it. Tell your dad who loves Dire Straits (who doesn't) and Steely Dan (seriously, who doesn't?) that this is a new band called Ham Planet and the Salads or something and soon enough, you and him will be drinking a Modelo and grilling up hot dogs.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "See No Evil",
        "duration": "3:56"
      },
      {
        "trackNumber": 2,
        "trackName": "Venus",
        "duration": "3:48"
      },
      {
        "trackNumber": 3,
        "trackName": "Friction",
        "duration": "4:43"
      },
      {
        "trackNumber": 4,
        "trackName": "Marquee Moon",
        "duration": "9:58"
      },
      {
        "trackNumber": 5,
        "trackName": "Elevation",
        "duration": "5:08"
      },
      {
        "trackNumber": 6,
        "trackName": "Guiding Light",
        "duration": "5:36"
      },
      {
        "trackNumber": 7,
        "trackName": "Prove It",
        "duration": "5:04"
      },
      {
        "trackNumber": 8,
        "trackName": "Torn Curtain",
        "duration": "7:00"
      }
    ]
  },
  {
    "id": 8,
    "entryNumber": "00008",
    "artist": "Guided by Voices",
    "album": "Alien Lanes",
    "yearReleased": "1995",
    "genre": "Indie Rock",
    "subGenre": "Rock, Lo-fi",
    "image": "alienlanes.jpg",
    "puremood": "Bedroom",
    "season": "Autumn",
    "party": "Yes",
    "lyric": "I want to start a new life with my valuable hunting knife",
    "review": "Shoutout Molly who might be a bigger Guided By Voices fan than me. I honestly thought about making this review really, really, really, really short like a Guided By Voices song, but I feel like Molly is the only person that would actually get that joke. Also, I think it's funnier to make a review that takes longer to read than half the tracks on this album. Guided By Voices is an interesting case. I don't mean like the rotting White Castle crave case that my friend Baxter and I found on my back steps 11 years ago covered in snow that had been sitting there for what I guess was months... no, I mean it in the traditional way, a brief case, because their songs are brief. Ok, sorry. So Alien Lanes is a study in patience. To someone who may only be used to highly produced rock albums, this album might seem like a funny joke. But if you let this album seep into your bones, it will become an addiction. This is the case for a lot of GBV albums. What's funny is everyone dreams about being in a band once in their lives, but Guided By Voices embody what it sounds like to actually start a band in a basement, sound and all. If you look beyond the lo-fi fuzz (which I love), you'll find pop songs that only The Beatles could dream up. I know that sounds like a statement made in a hyperbolic chamber, but I am serious. 'A Salty Salute,' 'Motor Away,' 'My Valuable Hunting Knife,' 'As We Go Up, We Go Down,' 'Game of Pricks'... don't even get me started on 'A Good Flying Bird.' Bands like Guided By Voices are important. Not only because of their often good to great quality but it's important to remind people that you don't have to produce an album that sounds like a vacuum hit it (Black Keys return to form, please). This album, like a lot of GBV albums, is a good study in keeping the audience wanting more. I listen to Alien Lanes over and over for the songwriting but also because it's akin to a good book that will keep you turning the page.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "A Salty Salute",
        "writer": "R. Pollard, Tobin Sprout",
        "duration": "1:29"
      },
      {
        "trackNumber": 2,
        "trackName": "Evil Speakers",
        "duration": "0:58"
      },
      {
        "trackNumber": 3,
        "trackName": "Watch Me Jumpstart",
        "duration": "2:24"
      },
      {
        "trackNumber": 4,
        "trackName": "They're Not Witches",
        "writer": "Greg Demos, Jim Pollard, R. Pollard",
        "duration": "0:51"
      },
      {
        "trackNumber": 5,
        "trackName": "As We Go Up, We Go Down",
        "duration": "1:37"
      },
      {
        "trackNumber": 6,
        "trackName": "(I Wanna Be a) Dumbcharger",
        "duration": "1:13"
      },
      {
        "trackNumber": 7,
        "trackName": "Game of Pricks",
        "duration": "1:33"
      },
      {
        "trackNumber": 8,
        "trackName": "The Ugly Vision",
        "duration": "1:34"
      },
      {
        "trackNumber": 9,
        "trackName": "A Good Flying Bird",
        "writer": "Tobin Sprout",
        "duration": "1:07"
      },
      {
        "trackNumber": 10,
        "trackName": "Cigarette Tricks",
        "writer": "Greg Demos, J. Pollard, R. Pollard, Tobin Sprout",
        "duration": "0:18"
      },
      {
        "trackNumber": 11,
        "trackName": "Pimple Zoo",
        "writer": "R. Pollard",
        "duration": "0:42"
      },
      {
        "trackNumber": 12,
        "trackName": "Big Chief Chinese Restaurant",
        "writer": "Jim Pollard, R. Pollard",
        "duration": "0:56"
      },
      {
        "trackNumber": 13,
        "trackName": "Closer You Are",
        "writer": "R. Pollard",
        "duration": "1:56"
      },
      {
        "trackNumber": 14,
        "trackName": "Auditorium",
        "writer": "R. Pollard, Tobin Sprout",
        "duration": "1:02"
      },
      {
        "trackNumber": 15,
        "trackName": "Motor Away",
        "writer": "R. Pollard, Tobin Sprout",
        "duration": "2:06"
      },
      {
        "trackNumber": 16,
        "trackName": "Hit",
        "writer": "R. Pollard",
        "duration": "0:23"
      },
      {
        "trackNumber": 17,
        "trackName": "My Valuable Hunting Knife",
        "writer": "R. Pollard",
        "duration": "2:00"
      },
      {
        "trackNumber": 18,
        "trackName": "Gold Hick",
        "writer": "R. Pollard",
        "duration": "0:30"
      },
      {
        "trackNumber": 19,
        "trackName": "King and Caroline",
        "writer": "R. Pollard, Tobin Sprout",
        "duration": "1:36"
      },
      {
        "trackNumber": 20,
        "trackName": "Striped White Jets",
        "writer": "R. Pollard",
        "duration": "2:15"
      },
      {
        "trackNumber": 21,
        "trackName": "Ex-Supermodel",
        "writer": "R. Pollard, Tobin Sprout",
        "duration": "1:06"
      },
      {
        "trackNumber": 22,
        "trackName": "Blimps Go 90",
        "writer": "R. Pollard",
        "duration": "1:40"
      },
      {
        "trackNumber": 23,
        "trackName": "Strawdogs",
        "writer": "Tobin Sprout",
        "duration": "1:17"
      },
      {
        "trackNumber": 24,
        "trackName": "Chicken Blows",
        "writer": "R. Pollard",
        "duration": "2:21"
      },
      {
        "trackNumber": 25,
        "trackName": "Little Whirl",
        "writer": "Tobin Sprout",
        "duration": "1:46"
      },
      {
        "trackNumber": 26,
        "trackName": "My Son Cool",
        "writer": "R. Pollard",
        "duration": "1:41"
      },
      {
        "trackNumber": 27,
        "trackName": "Always Crush Me",
        "writer": "R. Pollard",
        "duration": "1:44"
      },
      {
        "trackNumber": 28,
        "trackName": "Alright",
        "writer": "R. Pollard",
        "duration": "2:56"
      }
    ]
  },
  {
    "id": 9,
    "entryNumber": "00009",
    "artist": "Wilco",
    "album": "Being There",
    "yearReleased": "1996",
    "genre": "Alt Country",
    "subGenre": "Rock",
    "image": "beingthere.png",
    "puremood": "Cookout",
    "season": "Summer",
    "party": "Yes",
    "lyric": "What's the world got in store for you now?",
    "review": "Wilco is an interesting band. I read Jeff Tweedy's autobiography last year and his laissez-faire attitude to the music industry aligned with his output, sure, but I have met people who have no idea about Yankee Hotel Foxtrot who love this band. But it's for later career music. I love most of their material but their first 5 or so releases are reaching for something more than what they have been doing lately. Hell, I remember hearing comedian Burnt Chrysler talk about his affinity toward the band. He doesn't seem like someone who thinks about music beyond what makes him feel good. And that is completely fine. I do that as well half of the time. But Wilco is an interesting band. They come from punk roots, essentially created the 2nd wave of Alt Country by adding some punk to it (not to be confused with your Gun Club and Minutemen cowpunk types). But somehow, they are so good at what they do, they appeal to everyone. Even if you don't think you like Wilco, at least listen to this album (or Yankee Hotel Foxtrot) and you'll find a lot of what most music enthusiasts would consider 'important music'. That being, tons of personality, a disregard of coloring in the lines, and genuine, real songwriting. Being There is a long album but it doesn't feel that way. It feels clean, easy to digest, and rewarding if you are willing to listen multiple times. I think they have fallen into the 'legacy act' category that so many bands do but I feel like they deserve so much more.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Misunderstood",
        "writer": "Tweedy",
        "duration": "6:28"
      },
      {
        "trackNumber": 2,
        "trackName": "Far, Far Away",
        "writer": "Tweedy",
        "duration": "3:20"
      },
      {
        "trackNumber": 3,
        "trackName": "Monday",
        "writer": "Tweedy",
        "duration": "3:33"
      },
      {
        "trackNumber": 4,
        "trackName": "Outtasite (Outta Mind)",
        "writer": "Tweedy",
        "duration": "2:34"
      },
      {
        "trackNumber": 5,
        "trackName": "Forget the Flowers",
        "writer": "Tweedy",
        "duration": "2:47"
      },
      {
        "trackNumber": 6,
        "trackName": "Red-Eyed and Blue",
        "writer": "Tweedy",
        "duration": "2:45"
      },
      {
        "trackNumber": 7,
        "trackName": "I Got You (At the End of the Century)",
        "writer": "Tweedy",
        "duration": "3:57"
      },
      {
        "trackNumber": 8,
        "trackName": "What's the World Got in Store",
        "writer": "Tweedy",
        "duration": "3:09"
      },
      {
        "trackNumber": 9,
        "trackName": "Hotel Arizona",
        "writer": "Tweedy",
        "duration": "3:37"
      },
      {
        "trackNumber": 10,
        "trackName": "Say You Miss Me",
        "writer": "Tweedy",
        "duration": "4:07"
      },
      {
        "trackNumber": 11,
        "trackName": "Sunken Treasure",
        "writer": "Tweedy",
        "duration": "6:51"
      },
      {
        "trackNumber": 12,
        "trackName": "Someday Soon",
        "writer": "Tweedy",
        "duration": "2:33"
      },
      {
        "trackNumber": 13,
        "trackName": "Outta Mind (Outta Sight)",
        "writer": "Tweedy",
        "duration": "3:20"
      },
      {
        "trackNumber": 14,
        "trackName": "Someone Else's Song",
        "writer": "Tweedy",
        "duration": "3:21"
      },
      {
        "trackNumber": 15,
        "trackName": "Kingpin",
        "writer": "Tweedy",
        "duration": "5:17"
      },
      {
        "trackNumber": 16,
        "trackName": "(Was I) In Your Dreams",
        "writer": "Tweedy",
        "duration": "3:30"
      },
      {
        "trackNumber": 17,
        "trackName": "Why Would You Wanna Live",
        "writer": "Tweedy",
        "duration": "4:16"
      },
      {
        "trackNumber": 18,
        "trackName": "The Lonely 1",
        "writer": "Tweedy",
        "duration": "4:48"
      },
      {
        "trackNumber": 19,
        "trackName": "Dreamer in My Dreams",
        "writer": "Tweedy",
        "duration": "6:43"
      }
    ]
  },
  {
    "id": 10,
    "entryNumber": "00010",
    "artist": "Fugazi",
    "album": "The Argument",
    "yearReleased": "2001",
    "genre": "Punk",
    "subGenre": "Post Punk",
    "image": "fugazi.jpg",
    "puremood": "Basement",
    "season": "Winter",
    "party": "Yes",
    "lyric": "Inside your mouth all comet cleaned and scrubbed down",
    "review": "It's hard to rap. I am only saying that because I was going to start this review with 'It's hard to wrap your mind around...' blah blah blah 1, 2, 3, repeater. I think the further I go writing these 'reviews'... let's call them vague sense memories... the more gonzo I want to end up. But yeah, you're right, past Mike. It IS hard to wrap your mind around Fugazi. In any other life, these guys would still be pumping out some of the best-written songs of any generation. The Argument is their last record and their best record. I like to think they finished up this album, said 'well, if we get any better than this, we are going to become annoying so might as well end the public idea of Fugazi.' What's even cooler about this band is it's well-documented that this band never broke up. They still play but only privately. I suppose we just have to take their word for it because unless you are/were in Fugazi and you're reading this, I can't imagine you knowing for sure. As much as I hate that I will probably never get to see them live, I have to admire their full stop as a band, at least publicly. They cranked out some really great albums and then released their finest to date only to say they were done. I think us as people, myself definitely included, tend to ride things to the bone. It's aspirational to know when to end something even if it's as compelling as what Fugazi was able to produce.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Untitled (intro)",
        "duration": "0:52"
      },
      {
        "trackNumber": 2,
        "trackName": "Cashout",
        "writer": "MacKaye",
        "duration": "4:24"
      },
      {
        "trackNumber": 3,
        "trackName": "Full Disclosure",
        "writer": "Picciotto",
        "duration": "3:53"
      },
      {
        "trackNumber": 4,
        "trackName": "Epic Problem",
        "writer": "MacKaye",
        "duration": "3:59"
      },
      {
        "trackNumber": 5,
        "trackName": "Life and Limb",
        "writer": "Picciotto",
        "duration": "3:09"
      },
      {
        "trackNumber": 6,
        "trackName": "The Kill",
        "writer": "Lally",
        "duration": "5:27"
      },
      {
        "trackNumber": 7,
        "trackName": "Strangelight",
        "writer": "Picciotto",
        "duration": "5:53"
      },
      {
        "trackNumber": 8,
        "trackName": "Oh",
        "writer": "Picciotto",
        "duration": "4:29"
      },
      {
        "trackNumber": 9,
        "trackName": "Ex-Spectator",
        "writer": "MacKaye",
        "duration": "4:18"
      },
      {
        "trackNumber": 10,
        "trackName": "Nightshop",
        "writer": "Picciotto",
        "duration": "4:02"
      },
      {
        "trackNumber": 11,
        "trackName": "Argument",
        "writer": "MacKaye",
        "duration": "4:27"
      }
    ]
  },
  {
    "id": 11,
    "entryNumber": "00011",
    "artist": "Silver Jews",
    "album": "American Water",
    "yearReleased": "1998",
    "genre": "Alt Country",
    "subGenre": "Rock",
    "image": "americanwater.jpg",
    "puremood": "Cookout",
    "season": "Summer",
    "party": "Yes",
    "lyric": "It's sunny and 75 it feels so good to be alive",
    "review": "I don't claim to have a way with words. As a matter of fact, I think it's pretty obvious I don't from all of these cool reviews I am making. But I would like to have a hold of it. The words, I mean. I wish I could melt my feelings down into a bowl and feed them to the word processor I am typing into on my computer so people can say 'wow, that guy has a way with words'. But I don't, and that is fine. I don't do this to make people think that. I doubt anyone will actually read any of these reviews. What's funny is I think David Berman didn't care either, but still, he wrote like it was a requirement to stay alive. We still get types like this putting music out... Adrianne Lenker comes to mind... but no one like David Berman. He had a way of turning barroom talk into ballroom poetry. And to add to that, he did it all wrapped in Louisville slacker rock. It's a shame he felt the way he did before he took his own life. I know I said he probably didn't care what people think but now that I think about it, I bet he did. But in a different way. I think he wanted genuine love and not the 'oh my god I love your work can I get a selfie' type of love. I think maybe he felt unloved personally which I bet a lot of us feel from time to time. It's sad how it all ended with Berman, Silver Jews, but one thing you can't deny is that he left us with some good words when you're at your lowest.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Random Rules",
        "writer": "Berman",
        "duration": "4:00"
      },
      {
        "trackNumber": 2,
        "trackName": "Smith & Jones Forever",
        "writer": "Berman",
        "duration": "3:20"
      },
      {
        "trackNumber": 3,
        "trackName": "Night Society",
        "writer": "Berman",
        "duration": "2:19"
      },
      {
        "trackNumber": 4,
        "trackName": "Federal Dust",
        "writer": "David Berman, Stephen Malkmus",
        "duration": "4:03"
      },
      {
        "trackNumber": 5,
        "trackName": "People",
        "writer": "Berman",
        "duration": "4:45"
      },
      {
        "trackNumber": 6,
        "trackName": "Blue Arrangements",
        "writer": "Berman, Malkmus",
        "duration": "4:40"
      },
      {
        "trackNumber": 7,
        "trackName": "We Are Real",
        "writer": "Berman",
        "duration": "4:24"
      },
      {
        "trackNumber": 8,
        "trackName": "Send in the Clouds",
        "writer": "Berman",
        "duration": "5:26"
      },
      {
        "trackNumber": 9,
        "trackName": "Like Like the the the Death",
        "writer": "Berman",
        "duration": "4:00"
      },
      {
        "trackNumber": 10,
        "trackName": "Buckingham Rabbit",
        "writer": "Berman",
        "duration": "4:58"
      },
      {
        "trackNumber": 11,
        "trackName": "Honk If You're Lonely",
        "writer": "Berman, Gate Pratt",
        "duration": "2:49"
      },
      {
        "trackNumber": 12,
        "trackName": "The Wild Kindness",
        "writer": "Berman",
        "duration": "3:54"
      }
    ]
  },
  {
    "id": 12,
    "entryNumber": "00012",
    "artist": "The Avalanches",
    "album": "Since I Left You",
    "yearReleased": "2000",
    "genre": "Electronic",
    "subGenre": "Plunderphonics",
    "image": "avalanches.jpg",
    "puremood": "Warehouse",
    "season": "Summer",
    "party": "Yes",
    "lyric": "Watch the steps. Get a drink, have a good time now. Welcome to paradise, paradise, paradise...",
    "review": "One of my favorite Beach Boys albums is an often panned album for the band. The album is called 'Party!' and it sounds exactly like that... a Beach Boys Party! The songs are some Beach Boys tracks, a lot of covers, and what sounds like a campfire sing-along on the beach at night. I think the reason it gets dismissed by most is because it was completely fabricated but what are the Boys gonna do in the 1960s? Drag out thousands and thousands of dollars worth of recording equipment and the Wrecking Crew to a beach late at night? That would be inadvisable on the grounds that the sand might ruin all of the recording equipment and Glen Campbell's shoes! But what I love about the album is what I love about Since I Left You by The Avalanches. The fact that this album is 400 plus record samples smashed into one cohesive adventure aside, Since I Left You sounds like a party. I feel like I am soaking up the sun with a bunch of smelly, sweaty young people drinking sweet fruity cocktails without a care in the world. But on the subject of the fact that this album is essentially made up of 400 plus samples... dude. What an achievement. And while the Avalanches' output has been good after, it truly will never beat the hunger this group clearly had at the beginning of their career.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Since I Left You",
        "writer": "Robbie Chater, Tony Di Blasi, Gordon McQuilten, Darren Seltmann, Edward Drennen, Jeanne Salo, Jimmy Webb",
        "duration": "4:22"
      },
      {
        "trackNumber": 2,
        "trackName": "Stay Another Season",
        "writer": "Chater, Di Blasi, McQuilten, Seltmann, Alan Bergman, Marilyn Bergman, Johnny Mandel, Curtis Hudson, Lisa Stevens",
        "duration": "2:18"
      },
      {
        "trackNumber": 3,
        "trackName": "Radio",
        "writer": "Chater, Seltmann, Claude Cave",
        "duration": "4:22"
      },
      {
        "trackNumber": 4,
        "trackName": "Two Hearts in 3/4 Time",
        "writer": "Chater, Di Blasi, McQuilten, Seltmann, John Cale, Marlena Shaw",
        "duration": "3:23"
      },
      {
        "trackNumber": 5,
        "trackName": "Avalanche Rock",
        "writer": "Chater, Seltmann",
        "duration": "0:22"
      },
      {
        "trackNumber": 6,
        "trackName": "Flight Tonight",
        "writer": "Chater, Seltmann, Henry Lawes, Billy Rowe, Paul Huston, David Jolicoeur, Vincent Mason, Kelvin Mercer, Lawrence Dermer, Hubert Roberts, Henry Stone, Freddy Stonewall",
        "duration": "3:53"
      },
      {
        "trackNumber": 7,
        "trackName": "Close to You",
        "writer": "Chater, Seltmann, August Darnell, Ernest Isley, Marvin Isley, O'Kelly Isley, Jr., Ronald Isley, Rudolph Isley, Christopher Jasper",
        "duration": "3:54"
      },
      {
        "trackNumber": 8,
        "trackName": "Diners Only",
        "writer": "Chater, Seltmann, Saladine Wallace, Salahadeen Wilds, David Willis",
        "duration": "1:35"
      },
      {
        "trackNumber": 9,
        "trackName": "A Different Feeling",
        "writer": "Chater, Di Blasi, McQuilten, Seltmann, Raymond Evans, Jay Livingston",
        "duration": "4:22"
      },
      {
        "trackNumber": 10,
        "trackName": "Electricity",
        "writer": "Chater, Seltmann, Willie Clarke, Clarence Reid",
        "duration": "3:29"
      },
      {
        "trackNumber": 11,
        "trackName": "Tonight May Have To Last Me All My Life",
        "writer": "Chater, Seltmann, Donald Borzage, Johnny Mercer",
        "duration": "2:20"
      },
      {
        "trackNumber": 12,
        "trackName": "Pablo's Cruise",
        "writer": "Chater, Seltmann",
        "duration": "0:52"
      },
      {
        "trackNumber": 13,
        "trackName": "Frontier Psychiatrist",
        "writer": "Chater, Di Blasi, McQuilten, Seltmann, Dexter Fabay, Bert Kaempfert, Herbert Rehbein, Carl Sigman",
        "duration": "4:47"
      },
      {
        "trackNumber": 14,
        "trackName": "Etoh",
        "writer": "Chater, Seltmann",
        "duration": "5:02"
      },
      {
        "trackNumber": 15,
        "trackName": "Summer Crane",
        "writer": "Chater, Seltmann, Bobby Lee Trammell",
        "duration": "4:39"
      },
      {
        "trackNumber": 16,
        "trackName": "Little Journey",
        "writer": "Chater, Seltmann, Hudson, Stevens, John Phillips",
        "duration": "1:35"
      },
      {
        "trackNumber": 17,
        "trackName": "Live at Dominoes",
        "writer": "Chater, Seltmann, Frank Farian, Fred Jay, George Reyam",
        "duration": "5:39"
      },
      {
        "trackNumber": 18,
        "trackName": "Extra Kings",
        "writer": "Chater, Seltmann, Trammell, Alan Osmond, Merrill Osmond, Wayne Osmond",
        "duration": "3:46"
      }
    ]
  },
  {
    "id": 13,
    "entryNumber": "00013",
    "artist": "Gram Parsons",
    "album": "Grievous Angel",
    "yearReleased": "1974",
    "genre": "Alt Country",
    "subGenre": "Country",
    "image": "gram.jpg",
    "puremood": "Cookout",
    "season": "Summer",
    "party": "Yes",
    "lyric": "And I saw my devil and I saw my deep blue sea. And I thought about a calico bonnet from Cheyenne to Tennessee",
    "review": "I love the way country music makes me feel, and I do mean country music. I won't belabor the sentiment that modern so-called 'Pop Country' is soulless, weak-willed, and honestly, the reason why I have to say to people 'but like, Gram Parsons, Lucinda Williams, Willie Nelson, Lydia Loveless, Tyler Childers, George Strait, Joe Diffie type of stuff' when I tell them I like country. I honestly don't know another genre where people have to feel compelled to say that. That is how bad country has gotten. I think the problem is that people don't realize that country music at its heart is for the people, and should be by the people. It's like punk's less angsty cousin. They might sound different but they both drink the same way at the end of the day. They both party, ya know? Grievous Angel is a front porch in the desert type of album. I can feel the sun just listening to the thing. In Gram Parsons' world, all beer is colder than cold, all hearts are mending, and all vocals are accompanied by Emmylou Harris. What's not to like about that? And the slide guitar... you can't make a violin sound more sentimental and cry emotion like the slide guitar on this album. If you live in Camp I Hate Country, please just check this album out. Crack a beer, sit on your back porch, and bathe inside of its warm hug.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Return of the Grievous Angel",
        "writer": "Gram Parsons, Tom Brown",
        "duration": "4:19"
      },
      {
        "trackNumber": 2,
        "trackName": "Hearts on Fire",
        "writer": "Walter Egan, Tom Guidera",
        "duration": "3:50"
      },
      {
        "trackNumber": 3,
        "trackName": "I Can't Dance",
        "writer": "Tom T. Hall",
        "duration": "2:20"
      },
      {
        "trackNumber": 4,
        "trackName": "Brass Buttons",
        "writer": "Gram Parsons",
        "duration": "3:27"
      },
      {
        "trackNumber": 5,
        "trackName": "$1000 Wedding",
        "writer": "Gram Parsons",
        "duration": "5:00"
      },
      {
        "trackNumber": 6,
        "trackName": "Medley Live from Northern Quebec",
        "writer": "Charlie Louvin, Ira Louvin (\"Cash on the Barrelhead\"), Gram Parsons, Bob Buchanan (\"Hickory Wind\")",
        "duration": "6:27"
      },
      {
        "trackNumber": 7,
        "trackName": "Love Hurts",
        "writer": "Boudleaux Bryant",
        "duration": "3:40"
      },
      {
        "trackNumber": 8,
        "trackName": "Ooh Las Vegas",
        "writer": "Gram Parsons, Ric Grech",
        "duration": "3:29"
      },
      {
        "trackNumber": 9,
        "trackName": "In My Hour of Darkness",
        "writer": "Gram Parsons, Emmylou Harris",
        "duration": "3:42"
      }
    ]
  },
  {
    "id": 14,
    "entryNumber": "00014",
    "artist": "OutKast",
    "album": "Aquemini",
    "yearReleased": "1998",
    "genre": "Hip Hop",
    "subGenre": "Southern Hip Hop",
    "image": "Aquemini.jpg",
    "puremood": "Cookout",
    "season": "Summer",
    "party": "Yes",
    "lyric": "You might call us country, but we's only Southern. And I don't give a fuck, P-Funk spot to spark another",
    "review": "\"George Clinton is a feature on this album and there are still like 7 songs that are better\" should be all you need to know about the quality of Aquemini. To most people that have met me in real life, I am a white dude. The small percentage who aren't sure of my race are those annoying people who 'dont see race' or whatever. I'm joking. I'm White. I'm Mike! And I love this album. OutKast was a pretty important formative group for me due to them frontfacing how weird they are. Nowadays, being weird and younger seems to be accepted way more than it was when I was growing up. I don't say that as an old 'back in my day' fart... even though it sounds exactly like that... I say that because you have groups like OutKast to thank for said acceptance. I remember talking about how much I loved Saves The Day in Math class my sophomore year and that was enough to summon the ridicule of the cool kids. Now stuff that sounds like Saves the Day is considered old people Millennial claptrap. Life's a funny fuckin' thing. But I don't regret being a weird guy in school or now. I abhor people who regularly say 'you have too much time on your hands' because someone has a hobby or an interest that goes beyond whatever true crime Netflix show is consuming them. Please, do not get this twisted: I don't want to sound like I am averse to the type because of their choice of free time but instead because they are so void of interest, it's easier to dismiss a hobby or interest than to learn about it. What was I talking about? Oh, one last thing:\"She said, lets hit the parking lot so i can sick your duck\" is bars. ",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Hold On, Be Strong",
        "writer": "Donny Mathis",
        "duration": "1:11"
      },
      {
        "trackNumber": 2,
        "trackName": "Return of the 'G'",
        "writer": "Giorgio Moroder, Organized Noize, Antwan Patton, André Benjamin",
        "duration": "4:49"
      },
      {
        "trackNumber": 3,
        "trackName": "Rosa Parks",
        "writer": "Antwan Patton, André Benjamin",
        "duration": "5:24"
      },
      {
        "trackNumber": 4,
        "trackName": "Skew It on the Bar-B (featuring Raekwon)",
        "writer": "Morton Stevens, Organized Noize, Antwan Patton, André Benjamin, Corey Woods",
        "duration": "3:15"
      },
      {
        "trackNumber": 5,
        "trackName": "Aquemini",
        "writer": "Antwan Patton, André Benjamin",
        "duration": "5:19"
      },
      {
        "trackNumber": 6,
        "trackName": "Synthesizer (featuring George Clinton)",
        "writer": "Antwan Patton, André Benjamin, George Clinton",
        "duration": "5:11"
      },
      {
        "trackNumber": 7,
        "trackName": "Slump",
        "writer": "Antwan Patton, Jamahr Williams, Frederick Bell",
        "duration": "5:09"
      },
      {
        "trackNumber": 8,
        "trackName": "West Savannah",
        "writer": "Organized Noize, Antwan Patton",
        "duration": "4:03"
      },
      {
        "trackNumber": 9,
        "trackName": "Da Art of Storytellin' (Pt. 1)",
        "writer": "David Sheats, Antwan Patton, André Benjamin",
        "duration": "3:43"
      },
      {
        "trackNumber": 10,
        "trackName": "Da Art of Storytellin' (Pt. 2)",
        "writer": "David Sheats, Antwan Patton, André Benjamin",
        "duration": "2:48"
      },
      {
        "trackNumber": 11,
        "trackName": "Mamacita",
        "writer": "Organized Noize, Antwan Patton, André Benjamin, Masada Hogans, Erin Johnson",
        "duration": "5:52"
      },
      {
        "trackNumber": 12,
        "trackName": "SpottieOttieDopaliscious",
        "writer": "Antwan Patton, André Benjamin, Patrick Brown",
        "duration": "7:07"
      },
      {
        "trackNumber": 13,
        "trackName": "Y'all Scared (featuring T-Mo, Big Gipp, and Khujo)",
        "writer": "David Sheats, Antwan Patton, André Benjamin, Robert Barnett, Willie Knighton, Jr., Cameron Gipp",
        "duration": "4:50"
      },
      {
        "trackNumber": 14,
        "trackName": "Nathaniel",
        "writer": "",
        "duration": "1:10"
      },
      {
        "trackNumber": 15,
        "trackName": "Liberation (with Cee-Lo and Erykah Badu)",
        "writer": "Antwan Patton, André Benjamin, Ruben Bailey, Erica Wright, Joi Gilliam, Myrna Crenshaw, Thomas Burton",
        "duration": "8:46"
      },
      {
        "trackNumber": 16,
        "trackName": "Chonkyfire",
        "writer": "Antwan Patton, André Benjamin",
        "duration": "6:10"
      }
    ]
  },
  {
    "id": 15,
    "entryNumber": "00015",
    "artist": "The Velvet Underground",
    "album": "White Light/White Heat",
    "yearReleased": "1968",
    "genre": "Rock",
    "subGenre": "Proto Punk",
    "image": "whitelight.jpg",
    "puremood": "Basement",
    "season": "Winter",
    "party": "No",
    "lyric": "Dressed in silk, Latin lace, and envy. Pride and joy of the latest penny fair",
    "review": "I am certainly not the first person to say how much of an impact The Velvet Underground had on the music that came after. There is a quote that I am going to half-ass that says 'Only a handful of people bought the first Velvet Underground album when it was released but every single one of those people started a band after.' I hear that quote is misleading and the first Velvet Underground album actually did pretty alright in sales. Now, did it turn Lou Reed into John Lennon? No. But still, I think that quote is a bit hyperbolic in a literal sense. But the quote does one thing right: it captures the importance the Velvet Underground had on your tossed-aside and people who were tired of your normal fare being played on the radio back when they were in their prime and even now. I love that first record. Actually, I love all four of their albums (Squeeze doesn't exist). But White Light/White Heat is an example of reaching the edge of what could and should be done in music. I hear a lot of Merzbow hate in the world but we need artists like Merzbow and albums like White Light/White Heat to draw a line on what is considered doable. Without this album, I can guarantee your noisy, abrasive, and most exciting bands wouldn't exist. Also, it's a great album to test the ranges on your new stereo speakers to make sure they are going to accept the biggest shitload of bbbbbbbbbrrrrrrrrrrrrrrr possible.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "White Light/White Heat",
        "writer": "Lou Reed",
        "duration": "2:47"
      },
      {
        "trackNumber": 2,
        "trackName": "The Gift",
        "writer": "Lou Reed, Sterling Morrison, John Cale, Maureen Tucker",
        "duration": "8:18"
      },
      {
        "trackNumber": 3,
        "trackName": "Lady Godiva's Operation",
        "writer": "Lou Reed",
        "duration": "4:56"
      },
      {
        "trackNumber": 4,
        "trackName": "Here She Comes Now",
        "writer": "Lou Reed, Sterling Morrison, John Cale",
        "duration": "2:04"
      },
      {
        "trackNumber": 5,
        "trackName": "I Heard Her Call My Name",
        "writer": "Lou Reed",
        "duration": "4:38"
      },
      {
        "trackNumber": 6,
        "trackName": "Sister Ray",
        "writer": "Lou Reed, Sterling Morrison, John Cale, Maureen Tucker",
        "duration": "17:28"
      }
    ]
  },
  {
    "id": 16,
    "entryNumber": "00016",
    "artist": "Kendrick Lamar",
    "album": "To Pimp a Butterfly",
    "yearReleased": "2015",
    "genre": "Hip Hop",
    "subGenre": "Progressive Rap, Jazz Rap",
    "image": "tpab.jpg",
    "puremood": "Library",
    "season": "Spring",
    "party": "Yes",
    "lyric": "They give us guns and drugs, call us thugs, make it they promise to fuck with you. No condom, they fuck with you, Obama say: What it do?",
    "review": "What can I truly say about To Pimp a Butterfly that hasn't already been said in print, on every review website, podcast, and YouTube essay already? It's a modern marvel not only in hip hop but all of music. The reach this thing has at a creative standpoint is God-tier. No, it's a tier above God. And while there is a shortlist of hip-hop records I like just a little more than this one, To Pimp a Butterfly is objectively the most well-put-together. I don't need to say this stuff. You know it. I know it. Shitfarter69MusicReviews on YouTube knows it. So instead, since I am writing this on the day, month, and year of our Lord (which, if you have been paying attention, is To Pimp a Butterfly by Kendrick Lamar) 05/01/2024. Drake, what are you going to do, man? He said 'I hate the way that you walk, the way that you talk, I hate the way that you dress. I hate the way that you sneak diss, if I catch flight, it's gon' be direct.' He threw that weird way you say 'thaaaoot' back at you by calling you a deadbeat dad! Man, I would be so scared if I were you, Drake. And you know why? Because I am going to premiere my Drake diss track right now as well! So get ready, you freaking butthole. Here it comes: 'Weeeeeeeeeelllll my name is Mike and I'm here to say that I listen to Dot instead of Drake! Your hair is silly and you are too rich. Kendrick was right, you ARE a bad bitch!' Heh, try to come back from that, dude. Bet you won't.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Wesley's Theory",
        "writer": "Kendrick Duckworth, George Clinton, Steven Ellison, Ronald Colson, Stephen Bruner, Boris Gardiner",
        "duration": "4:47"
      },
      {
        "trackNumber": 2,
        "trackName": "For Free? (Interlude)",
        "writer": "Kendrick Duckworth, Terrace Martin, Rose McKinney",
        "duration": "2:10"
      },
      {
        "trackNumber": 3,
        "trackName": "King Kunta",
        "writer": "Kendrick Duckworth, Mark Spears, Johnny Burns, Michael Jackson, Ahmad Lewis, Stefan Gordy",
        "duration": "3:54"
      },
      {
        "trackNumber": 4,
        "trackName": "Institutionalized",
        "writer": "Kendrick Duckworth, Columbus Smith, Fredrik Halldin, Sam Barsh",
        "duration": "4:31"
      },
      {
        "trackNumber": 5,
        "trackName": "These Walls",
        "writer": "Kendrick Duckworth, Martin, Larrance Dopson, James Fauntleroy, McKinney",
        "duration": "5:00"
      },
      {
        "trackNumber": 6,
        "trackName": "U",
        "writer": "Kendrick Duckworth, Taz Arnold, Michael Brown",
        "duration": "4:28"
      },
      {
        "trackNumber": 7,
        "trackName": "Alright",
        "writer": "Kendrick Duckworth, Pharrell Williams, Spears",
        "duration": "3:39"
      },
      {
        "trackNumber": 8,
        "trackName": "For Sale? (Interlude)",
        "writer": "Kendrick Duckworth, Arnold",
        "duration": "4:51"
      },
      {
        "trackNumber": 9,
        "trackName": "Momma",
        "writer": "Kendrick Duckworth, Glen Boothe, Arnold, Sylvester Stewart, Lalah Hathaway, Rahsaan Patterson, Rex Rideout",
        "duration": "4:43"
      },
      {
        "trackNumber": 10,
        "trackName": "Hood Politics",
        "writer": "Kendrick Duckworth, Donte Perkins, Spears, Bruner, Sufjan Stevens",
        "duration": "4:52"
      },
      {
        "trackNumber": 11,
        "trackName": "How Much a Dollar Cost",
        "writer": "Kendrick Duckworth, Martin, Josef Leimberg, McKinney, Fauntleroy, Ronald Isley",
        "duration": "4:21"
      },
      {
        "trackNumber": 12,
        "trackName": "Complexion (A Zulu Love)",
        "writer": "Kendrick Duckworth, Bruner, Spears, Marlanna Evans",
        "duration": "4:23"
      },
      {
        "trackNumber": 13,
        "trackName": "The Blacker the Berry",
        "writer": "Kendrick Duckworth, Matthew Samuels, Stephen Kozmeniuk, Ken Lewis, Brent Kolatalo, Jefferey Campbell, Alexander Izquierdo",
        "duration": "5:28"
      },
      {
        "trackNumber": 14,
        "trackName": "You Ain't Gotta Lie (Momma Said)",
        "writer": "Kendrick Duckworth, Martin, McKinney, Leimberg, Spears",
        "duration": "4:01"
      },
      {
        "trackNumber": 15,
        "trackName": "I",
        "writer": "Kendrick Duckworth, Smith, Ro. Isley, O'Kelly Isley, Jr., Ernie Isley, Marvin Isley, Rudolph Isley, Christopher Jasper",
        "duration": "5:36"
      },
      {
        "trackNumber": 16,
        "trackName": "Mortal Man",
        "writer": "Kendrick Duckworth, Spears, Bruner, Fela Anikulapo Kuti",
        "duration": "12:07"
      }
    ]
  },
  {
    "id": 17,
    "entryNumber": "00017",
    "artist": "Chromatics",
    "album": "Night Drive",
    "yearReleased": "2007",
    "genre": "Electronic",
    "subGenre": "Synthwave",
    "image": "nightdrive.jpg",
    "puremood": "Warehouse",
    "season": "Autumn",
    "party": "Yes",
    "lyric": "My leather glove grips the wheel. I see the sun disappear",
    "review": "I just want to talk about Tick of the Clock right now. Don't get me wrong: there is a reason why this album made it here. I think it's an incredibly cool, very sexy, and often comforting album. But Tick of the Fucking Clock, dude. For those of you who are Krautrock fans, you know what I mean. The meditative quality these sorts of songs exude: driving beat, slowly leading to something but you aren't sure what. Maybe it's something cool, maybe something scary... most likely in this case it's just leading back to where it started. I am listening to this album right now but I am halfway through the title track so give me a second and let me put on Tick of the Clock. Ok, that's better. That's nice. I have very odd music choices sometimes when I run. One of my best runs, I listened to Biosphere's Substrata and Brian Eno & Harold Budd's The Pearl (more on that last one in the review section of this site). I think Tick of the Clock is up there with songs I have run to the most along with 'Nobody's Fool' by Kenny Loggins and the Arithmatix Remix of 'Pick Up The Phone' by Dragonette, and those songs are no brainers when it comes to getting your heart pumping. So why run to the minimalist techno/synthwave Tick of the Clock so much? Because I want to. But mainly because there is a focus to the driving beat it has. It's a great way to forget what you are and to focus on what you're doing.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "The Telephone Call",
        "writer": "Jewel",
        "duration": "1:51"
      },
      {
        "trackNumber": 2,
        "trackName": "Night Drive",
        "writer": "Jewel",
        "duration": "3:44"
      },
      {
        "trackNumber": 3,
        "trackName": "I Want Your Love",
        "writer": "Jewel",
        "duration": "6:41"
      },
      {
        "trackNumber": 4,
        "trackName": "Running Up That Hill (Kate Bush cover)",
        "writer": "Kate Bush",
        "duration": "6:07"
      },
      {
        "trackNumber": 5,
        "trackName": "Killing Spree (Instrumental)",
        "writer": "Jewel",
        "duration": "3:58"
      },
      {
        "trackNumber": 6,
        "trackName": "Healer",
        "writer": "Jewel",
        "duration": "3:53"
      },
      {
        "trackNumber": 7,
        "trackName": "Mask",
        "writer": "Jewel",
        "duration": "5:35"
      },
      {
        "trackNumber": 8,
        "trackName": "Tomorrow Is So Far Away",
        "writer": "Jewel",
        "duration": "7:06"
      },
      {
        "trackNumber": 9,
        "trackName": "Let's Make This a Moment to Remember (Instrumental)",
        "writer": "Jewel",
        "duration": "3:30"
      },
      {
        "trackNumber": 10,
        "trackName": "Tick of the Clock (Instrumental)",
        "writer": "Jewel",
        "duration": "15:39"
      }
    ]
  },
  {
    "id": 18,
    "entryNumber": "00018",
    "artist": "Tim Hecker",
    "album": "Virgins",
    "yearReleased": "2013",
    "genre": "Ambient",
    "subGenre": "Drone, Electrionic",
    "image": "timhecker.jpg",
    "puremood": "Twin Peaks",
    "season": "Autumn",
    "party": "No",
    "lyric": "------",
    "review": "A Good Tim Hecker album title would be 'A Dog in the Dark Looked like a Bear'. I say that because I have a distinct memory of a dog in the dark looking like a bear while listening to Virgins by Tim Hecker. By the way, I am very much conscious of not writing Tim Heidecker when I write Tim Heidecker. Ah crap! I did it. Well, the backspace key on my keyboard is broken so there she stays. So one very early summer morning, I woke up and decided to take a walk around my neighborhood. Some friends of mine and I planned our first of many cabin getaways so I had Christmas morning fever. The sun was just peeking through the clouds on my walk when I saw a weird, more black than dark object running about 400 feet away. I was deep into 'Live Room,' the most sinister of the songs on this album when I saw what at the time I thought was a giant bear running around and if you are familiar with that track while reading this, you can understand that I was so scared I was pooping your pants. The closer I got, the more I realized it was just a dog running around being an asshole so I didn't end up getting eaten by a bear if that was a concern. But it's a good study of how music affects us in a deep way. If I was listening to something like Sloan or James Taylor... something unassuming... would I have had the freak out I did? Maybe. Probably not. Either way, it's a great testament to what power this album has. It can manifest a bear right in front of you even if it's a dog just farting around in the grass. I never got to meet the dog but I did go on the cabin trip. I had the best time and now I have a few more grey hairs. I say that to demonstrate that time has passed.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Prism",
        "writer": "Hecker",
        "duration": "2:53"
      },
      {
        "trackNumber": 2,
        "trackName": "Virginal I",
        "writer": "Hecker",
        "duration": "6:16"
      },
      {
        "trackNumber": 3,
        "trackName": "Radiance",
        "writer": "Hecker",
        "duration": "3:22"
      },
      {
        "trackNumber": 4,
        "trackName": "Live Room",
        "writer": "Hecker",
        "duration": "7:02"
      },
      {
        "trackNumber": 5,
        "trackName": "Live Room Out",
        "writer": "Hecker",
        "duration": "2:37"
      },
      {
        "trackNumber": 6,
        "trackName": "Virginal II",
        "writer": "Hecker",
        "duration": "5:23"
      },
      {
        "trackNumber": 7,
        "trackName": "Black Refraction",
        "writer": "Hecker",
        "duration": "3:33"
      },
      {
        "trackNumber": 8,
        "trackName": "Incense at Abu Ghraib",
        "writer": "Hecker",
        "duration": "1:53"
      },
      {
        "trackNumber": 9,
        "trackName": "Amps, Drugs, Harmonium",
        "writer": "Hecker",
        "duration": "3:03"
      },
      {
        "trackNumber": 10,
        "trackName": "Stigmata I",
        "writer": "Hecker",
        "duration": "2:18"
      },
      {
        "trackNumber": 11,
        "trackName": "Stigmata II",
        "writer": "Hecker",
        "duration": "3:56"
      },
      {
        "trackNumber": 12,
        "trackName": "Stab Variation",
        "writer": "Hecker",
        "duration": "6:30"
      }
    ]
  },
  {
    "id": 19,
    "entryNumber": "00019",
    "artist": "Broken Social Scene",
    "album": "You Forgot It In People",
    "yearReleased": "2002",
    "genre": "Indie Rock",
    "subGenre": "Rock",
    "image": "bss.jpg",
    "puremood": "Lab",
    "season": "Spring",
    "party": "Yes",
    "lyric": "Park that car, drop that phone, sleep on the floor, dream about me",
    "review": "The opener Capture The Flag is very much in my blood. I have probably listened to this song 1000 times because I have listened to this album 1000 times at least. I attribute this album to switching my brain from 'music is cool I like it' to 'this shit is my entire life'. I bought this album, as I did with many albums in my teens, based on the cover at either a Best Buy or a local record shop. Come to think of it, I may have picked this up at a local record shop because the one I went to those days would have paper cutouts attached to the plastic CD holder explaining why it was an essential album. Huh. Did that record shop directly birth what I am doing here? Let's say it did. Let's say I wanted to keep that spirit alive instead of being a Software Dev looking to find a permanent home instead of taking Internship contracts and making things for 'clients' AKA friends. Either/Or (hey, I think I bought that Elliott Smith album at that same record shop!), I think every music lover has 'that moment'. The moment where they decide to become that annoying guy at a party saying shit like 'Yeah but Leonard Cohen was at his best in the 80s when he was making Sophisti-pop for hard-nosed detectives' and 'I wish Masayoshi Takanaka would make more stuff like AN INSATIABLE HIGH' and 'Tusk is my favorite album of all time' (check out my review of Tusk by Fleetwood Mac, shoutout to Lindsey Buckingham). This was that album for me. You Forgot It in People by Broken Social Scene if you forgot what I was talking about. I'm sorry I have a tendency to mosey about in these review type beats.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Capture the Flag",
        "writer": "Drew",
        "duration": "2:08"
      },
      {
        "trackNumber": 2,
        "trackName": "KC Accidental",
        "writer": "Drew",
        "duration": "3:50"
      },
      {
        "trackNumber": 3,
        "trackName": "Stars and Sons",
        "writer": "Drew",
        "duration": "5:08"
      },
      {
        "trackNumber": 4,
        "trackName": "Almost Crimes (Radio Kills Remix)",
        "writer": "Drew",
        "duration": "4:22"
      },
      {
        "trackNumber": 5,
        "trackName": "Looks Just Like the Sun",
        "writer": "Drew",
        "duration": "4:23"
      },
      {
        "trackNumber": 6,
        "trackName": "Pacific Theme",
        "writer": "Drew",
        "duration": "5:09"
      },
      {
        "trackNumber": 7,
        "trackName": "Anthems for a Seventeen Year-Old Girl",
        "writer": "Drew",
        "duration": "4:35"
      },
      {
        "trackNumber": 8,
        "trackName": "Cause = Time",
        "writer": "Drew",
        "duration": "5:30"
      },
      {
        "trackNumber": 9,
        "trackName": "Late Nineties Bedroom Rock for the Missionaries",
        "writer": "Drew",
        "duration": "3:46"
      },
      {
        "trackNumber": 10,
        "trackName": "Shampoo Suicide",
        "writer": "Drew",
        "duration": "4:05"
      },
      {
        "trackNumber": 11,
        "trackName": "Lover's Spit",
        "writer": "Drew",
        "duration": "6:22"
      },
      {
        "trackNumber": 12,
        "trackName": "I'm Still Your F*g",
        "writer": "Drew",
        "duration": "4:23"
      },
      {
        "trackNumber": 13,
        "trackName": "Pitter Patter Goes My Heart",
        "writer": "Drew",
        "duration": "2:26"
      }
    ]
  },
  {
    "id": 20,
    "entryNumber": "00020",
    "artist": "A Tribe Called Quest",
    "album": "Midnight Marauders",
    "yearReleased": "1993",
    "genre": "Hip Hop",
    "subGenre": "Conscious Hip Hop",
    "image": "tribemm.jpg",
    "puremood": "Cookout",
    "season": "Summer",
    "party": "Yes",
    "lyric": "Keep the poetry in my black knapsack. Got my Timbo hooves and my Doublemint pack",
    "review": "The guy on the cover of this album is holding his weiner, right? Is it supposed to mean the power of his manhood lives in his \"mic\"? I am going to say that is the case. I came to A Tribe Called Quest later in life through a friend who said they were his favorite group of all time. Don't get me wrong: I certainly have always enjoyed their music at parties while drunk and in the backseat of cars while drunk etc etc etc. I think what really start to believe they were one of the best hip hop groups of all time was on a sunny Saturday morning during a 5 mile run. I was at mile 2 and really struggling to get a good pace going. I pulled up a mix I made and it happened to have \"Steve Biko (Stir It Up)\" on it. From mile 2 on, I had figurative motors inside of my shoes. Everything on their albums, especially Midnight Marauders, fits perfectly together like the components that would make up a figurative motor you would put in a shoe or shoes to go fast. It's groups like A Tribe Called Quest that make me question people who say Taylor Swift is the greatest artist ever. I mean, I like some of those Taylor songs but what the fuck does she know about Maurading?! Look, I understand that some might think a guy talking about an album that has a guy rockin a piss from his microphone weiner and comparing it to Taylor Swift might be \"problematic\" and maybe it is. Does it make you feel any better to say Taylor Swift was the computerized woman in the interludes? Thats not true. Ok enough kidding around I am just being a silly guy. What a great album, stream Midnight Maruaders on itunes now.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Midnight Marauders Tour Guide",
        "writer": "Jonathan Davis, Ali Shaheed Muhammad, Malik Taylor",
        "duration": "0:45"
      },
      {
        "trackNumber": 2,
        "trackName": "Steve Biko (Stir It Up)",
        "writer": "Davis, Muhammad, Taylor",
        "duration": "3:11"
      },
      {
        "trackNumber": 3,
        "trackName": "Award Tour (featuring Trugoy the Dove)",
        "writer": "Davis, Muhammad, Taylor",
        "duration": "3:46"
      },
      {
        "trackNumber": 4,
        "trackName": "8 Million Stories",
        "writer": "Davis, Muhammad, Taylor, Skeff Anselm",
        "duration": "4:30"
      },
      {
        "trackNumber": 5,
        "trackName": "Sucka N****",
        "writer": "Davis, Muhammad, Taylor, Freddie Hubbard",
        "duration": "4:05"
      },
      {
        "trackNumber": 6,
        "trackName": "Midnight (featuring Raphael Wiggins)",
        "writer": "Davis, Muhammad, Taylor",
        "duration": "3:49"
      },
      {
        "trackNumber": 7,
        "trackName": "We Can Get Down",
        "writer": "Davis, Muhammad, Taylor",
        "duration": "4:19"
      },
      {
        "trackNumber": 8,
        "trackName": "Electric Relaxation",
        "writer": "Davis, Muhammad, Taylor",
        "duration": "4:04"
      },
      {
        "trackNumber": 9,
        "trackName": "Clap Your Hands",
        "writer": "Davis, Muhammad, Taylor, Bob James, Leo Nocentelli, George Porter Jr., Cyril Neville, Joseph Modeliste",
        "duration": "3:16"
      },
      {
        "trackNumber": 10,
        "trackName": "Oh My God (featuring Busta Rhymes)",
        "writer": "Davis, Muhammad, Taylor",
        "duration": "3:29"
      },
      {
        "trackNumber": 11,
        "trackName": "Keep It Rollin' (featuring Large Professor)",
        "writer": "Davis, Muhammad, Taylor, William Mitchell",
        "duration": "3:05"
      },
      {
        "trackNumber": 12,
        "trackName": "The Chase, Part II",
        "writer": "Davis, Muhammad, Taylor, Steve Arrington, Victor Godsey, Buddy Hankerson",
        "duration": "4:02"
      },
      {
        "trackNumber": 13,
        "trackName": "Lyrics to Go",
        "writer": "Davis, Muhammad, Taylor",
        "duration": "4:09"
      },
      {
        "trackNumber": 14,
        "trackName": "God Lives Through",
        "writer": "Davis, Muhammad, Taylor",
        "duration": "4:15"
      }
    ]
  },
  {
    "id": 21,
    "entryNumber": "00021",
    "artist": "Steely Dan",
    "album": "Aja",
    "yearReleased": "1977",
    "genre": "Yacht Rock",
    "subGenre": "Rock",
    "image": "aja.jpg",
    "puremood": "Yacht",
    "season": "Summer",
    "party": "Yes",
    "lyric": "Learn to work the saxophone, I'll play just what I feel. Drink Scotch whisky all night long and die behind the wheel",
    "review": "Back in 2005, there was a website called Channel 101 started by Rob Schrab and Dan Harmon. The website gave funny young people the opportunity to film and send in funny internet TV shows for the audience to view and then vote whether or not they would like to see more of it. This was all before YouTube blew up and became the hub for longform essays about why Scrappy Doo is a drug mule or something, so it was pretty ahead of its time. I am not going to act like I was one of those people who was actively watching at the time or voting or anything like that because I didn't know it existed. But a year later when YouTube started to become a thing thanks to Lazy Sunday, I was able to get caught up on one of the website's biggest shows: The Bu. I was a huge The OC fan and other than the Awesometown pilot (and the aforementioned Lazy Sunday), it was my first exposure to The Lonely Island. Essentially, it was a parody of The OC and was right in my Q zone. But the real standout show from Channel 101 was a show I learned about in 2007 when my friend Trent came to hang out at my apartment. A show that would introduce a new favorite genre I didn't know existed, and to be fair, the genre name didn't exist before the show so that would have been wild if I knew about it beforehand. Ok, enough taking the scenic route. The show was called Yacht Rock, and to this day, I watch it through at least once a year. My friend TJ has a tradition of watching it when we go on our yearly cabin trips, and sometimes when my roommates are gone, I'll quote lines from it at my roommate's dog. But the most important thing about this show is that it introduced a world of music to me that I assumed was for old people. And the most important group of the bunch was Steely Dan. And their most important album? Two Against Nature. Nah jk, it's Aja. There ain't a dud on this thing. I am still not sure what a Black Cow is, but Donald Fagen makes it sound like a delicious drink a really high person would love. I don't think I have ever met a Josie, but I bet she would be lovely. I used to know what Peg was about, but I forgot. Hopefully, it will come back to me. Big stuff on this one, folks.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Black Cow",
        "writer": "Becker, Fagen",
        "duration": "5:10"
      },
      {
        "trackNumber": 2,
        "trackName": "Aja",
        "writer": "Becker, Fagen",
        "duration": "8:00"
      },
      {
        "trackNumber": 3,
        "trackName": "Deacon Blues",
        "writer": "Becker, Fagen",
        "duration": "7:37"
      },
      {
        "trackNumber": 4,
        "trackName": "Peg",
        "writer": "Becker, Fagen",
        "duration": "3:57"
      },
      {
        "trackNumber": 5,
        "trackName": "Home at Last",
        "writer": "Becker, Fagen",
        "duration": "5:36"
      },
      {
        "trackNumber": 6,
        "trackName": "I Got the News",
        "writer": "Becker, Fagen",
        "duration": "5:07"
      },
      {
        "trackNumber": 7,
        "trackName": "Josie",
        "writer": "Becker, Fagen",
        "duration": "4:31"
      }
    ]
  },
  {
    "id": 22,
    "entryNumber": "00022",
    "artist": "Power Trip",
    "album": "Nightmare Logic",
    "yearReleased": "2017",
    "genre": "Metal",
    "subGenre": "Thrash Metal",
    "image": "powertrip.jpg",
    "puremood": "Basement",
    "season": "Autumn",
    "party": "Yes",
    "lyric": "Go on and look at you. Today is your lucky day. The executioner’s here and he's ready to make you pay",
    "review": "My dad was in a hair metal band in the 1980s that saw some success. They were regionally loved and would tour with significant acts. My mom was a metalhead growing up so they were a natural fit. So I came up on the likes of Metallica, Overkill, and Cinderella (my mom tells me Cinderella was my favorite band when I was 4 years old and right now at age 38, I couldn't tell you what they sound like). Metal was my first true love as far as music goes and it continued when bands like Korn and Fear Factory were making a name for themselves. But when I got to high school, like any 13-year-old, I wanted a new identity musically. I got into The Get Up Kids, Sunny Day Real Estate, Black Flag... eventually, I went through a Dave Matthews phase but I attribute that to accepting all genres of all types and not at all cringe. While I am on the subject, Dave Matthews gets a lot of heat. Moreso than a lot of those goofy-ass jam bands of that era. I will admit I haven't sat with a DMB album since I had a Saturn sport coupe and a burned CD copy of Before These Crowded Streets but 'Grey Street' still hits, right? I don't know I just feel like he is an easy target. Then again, my roommate will get drunk on margaritas by herself on our front porch listening to the same 5 Jimmy Buffett songs and I have no idea why she would do that so maybe the ire directed toward Dave Matthews Band is based on not understanding why. So Dave Matthews Band is not a metal band, I know that. But Power Trip is/was. It's such a shame Riley Gale had to die, as is with all people who have to die. His vocal style is what you want in a Thrash Metal group. It commands respect and snaps all the right bones. I know I spent most of this review talking about Dave Matthews Band but my hands are hurting from all the typing or whatever so if you want something that sounds like it was made inside of the devil's butt, check this out right away.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Soul Sacrifice",
        "writer": "",
        "duration": "4:12"
      },
      {
        "trackNumber": 2,
        "trackName": "Executioner's Tax (Swing of the Axe)",
        "writer": "",
        "duration": "3:46"
      },
      {
        "trackNumber": 3,
        "trackName": "Firing Squad",
        "writer": "",
        "duration": "3:19"
      },
      {
        "trackNumber": 4,
        "trackName": "Nightmare Logic",
        "writer": "",
        "duration": "4:23"
      },
      {
        "trackNumber": 5,
        "trackName": "Waiting Around to Die",
        "writer": "",
        "duration": "4:24"
      },
      {
        "trackNumber": 6,
        "trackName": "Ruination",
        "writer": "",
        "duration": "3:11"
      },
      {
        "trackNumber": 7,
        "trackName": "If Not Us Then Who",
        "writer": "",
        "duration": "4:11"
      },
      {
        "trackNumber": 8,
        "trackName": "Crucifixation",
        "writer": "",
        "duration": "5:22"
      }
    ]
  },
  {
    "id": 23,
    "entryNumber": "00023",
    "artist": "Ornette Coleman",
    "album": "The Shape of Jazz to Come",
    "yearReleased": "1959",
    "genre": "Jazz",
    "subGenre": "Avant Garde Jazz",
    "image": "ornette.jpg",
    "puremood": "Twin Peaks",
    "season": "Winter",
    "party": "No",
    "lyric": "------",
    "review": "So if you haven't looked around this site much, you may have missed the Pure Moods section. I always thought one component a lot of music websites was missing is to section off albums in HOW they feel instead of their specific genre. Drone albums are Drone albums but there is a stark difference between Stars of the Lid records and Earth records. They live in the same neighborhood but they have different personalities. Jazz is like this as well. You find different feelings and moods in Miles Davis' records that are a year apart. I bring this up because I am having trouble figuring out where to put The Shape of Jazz To Come by Ornette Coleman. On one hand, this album is technically locked in and it sounds incredible. So it should go in the Lab category, right? But on the other hand, this thing skips through the weird space so often, I may as well put it in Twin Peaks. The album wears all sorts of hats and they are all cool-looking because Jazz guys are always really cool-looking. There is a track on this record called 'Focus on Sanity' that sounds exactly like a future mental breakdown I will have one day which is a point in Twin Peaks favor. But good lord I feel like I am in the room with these guys. I think I am leaning Twin Peaks. Either way, I think this is a fantastic gateway into something more than Modal and should be (and I assume is) on the short list of must-listens in the jazz world. Also, the title was later referenced and repurposed by a bunch of anarcho-punk Swedes in the late 90s so that should count for something.",
    "tracks": [
      {
        "trackNumber": "1",
        "trackName": "Lonely Woman",
        "writer": "",
        "duration": "4:59"
      },
      {
        "trackNumber": "2",
        "trackName": "Eventually",
        "writer": "",
        "duration": "4:20"
      },
      {
        "trackNumber": "3",
        "trackName": "Peace",
        "writer": "",
        "duration": "9:04"
      },
      {
        "trackNumber": "4",
        "trackName": "Focus on Sanity",
        "writer": "",
        "duration": "6:50"
      },
      {
        "trackNumber": "5",
        "trackName": "Congeniality",
        "writer": "",
        "duration": "6:41"
      },
      {
        "trackNumber": "6",
        "trackName": "Chronology",
        "writer": "",
        "duration": "6:05"
      }
    ]
  },
  {
    "id": 24,
    "entryNumber": "00024",
    "artist": "Destroyer",
    "album": "Kaputt",
    "yearReleased": "2011",
    "genre": "Sophisti-Pop",
    "subGenre": "Indie Pop",
    "image": "kaputt.jpg",
    "puremood": "Yacht",
    "season": "Summer",
    "party": "Yes",
    "lyric": "Wasting your days, chasing some girls, alright chasing cocaine through the backrooms of the world all night",
    "review": "The New Pornographers, right? What a great band. What an extraordinary supergroup. Although, I hear that frontman AC Newman hates it when people call them a supergroup. But how could you not? AC Newman has written maybe 50 perfect pop songs, Neko Case has a voice that can't be shaken, and Dan Bejar is so much in his own lane that his songs stick out like a beautiful sore thumb on those albums. The New Pornos led me to solo Newman, Case, and of course, Bejar's solo outfit Destroyer. By the way, could there be a better name for a band? How he was able to claim that name before a Metal band did is beyond me but he did and here we are. Living in a Destroyer world. Kaputt is unlike any other Destroyer album. He was the king of snappy, smart Indie Rock filled with complex compositions and I guess one day he decided to make a Sophisti-Pop record. Somehow, that decision led to him putting out his best album by a mile. That's a compliment to Kaputt and not an insult to Rubies, Streethawk, or any of the other great Destroyer albums. What's funny is my friend Bill is an even bigger fan of Destroyer than I am and it was only until recently that he got to this release. I can't imagine how mind-blowing that was: already a fan for years and then getting to a beyond-perfect record. This album sways in the wind easy. This album is crystal clear water flowing from the mountains of China Crisis. This album moves differently. This album slowly fades into darkness, and lets the archangels take him. It is him, it will continue to be him. This shit ain't nothin' to me, man!",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Chinatown",
        "writer": "Bejar",
        "duration": "3:49"
      },
      {
        "trackNumber": 2,
        "trackName": "Blue Eyes",
        "writer": "Bejar",
        "duration": "4:07"
      },
      {
        "trackNumber": 3,
        "trackName": "Savage Night at the Opera",
        "writer": "Bejar",
        "duration": "4:24"
      },
      {
        "trackNumber": 4,
        "trackName": "Suicide Demo for Kara Walker",
        "writer": "Bejar",
        "duration": "8:26"
      },
      {
        "trackNumber": 5,
        "trackName": "Poor in Love",
        "writer": "Bejar",
        "duration": "3:26"
      },
      {
        "trackNumber": 6,
        "trackName": "Kaputt",
        "writer": "Bejar",
        "duration": "6:18"
      },
      {
        "trackNumber": 7,
        "trackName": "Downtown",
        "writer": "Bejar",
        "duration": "3:52"
      },
      {
        "trackNumber": 8,
        "trackName": "Song for America",
        "writer": "Bejar",
        "duration": "4:29"
      },
      {
        "trackNumber": 9,
        "trackName": "Bay of Pigs (Detail)",
        "writer": "Bejar",
        "duration": "11:19"
      }
    ]
  },
  {
    "id": 25,
    "entryNumber": "00025",
    "artist": "George Strait",
    "album": "Strait Country",
    "yearReleased": "1981",
    "genre": "Country",
    "subGenre": "Honkey-Tonk",
    "image": "strait.png",
    "puremood": "Cookout",
    "season": "Summer",
    "party": "Yes",
    "lyric": "Every time you throw dirt on her you lose a little ground",
    "review": "I have spent countless hours in person and online talking about how much Country gets a bad reputation due to the way modern pop country sounds now and how its roots and 2nd and 3rd wave tie into punk more than classic rock does. But I don't want to do that here. I would rather like to spend my time talking about one specific song on this album. This album overall is a true delight and really puts you in the dive bar under beer signs, sweating your brains off but all is okay because you have an American pilsner and a shot of the cheapest whisky at hand ready to transform your alright day into a great day. But there is a song on this son of a bitch called 'If You're Thinking You Want a Stranger (There's One Coming Home)' that is one of the most enchanting songs on the planet. It's like if Kenny Loggins went country, Jimmy Buffett made good music and in a perfect world, it would have influenced the world of modern mainstream country to this day. The chorus is a regular stone-cold Steve Rockism that adds a couple of palm trees, an ocean and some real-life barroom neon lights to hang above it. And lord forbid that kick drum leading into the chorus doesn't get its due. It should be inducted into the Hall of Fame of kick drums that lead into a chorus. That's not to say this album doesn't have other standouts: 'Blame It On Mexico,' 'Down and Out,' 'Friday Night Fever'... 'Strait Country' should be on every shortlist for your good ol' lounging music, genre or not.",
    "tracks": [
      {
        "trackNumber": "1",
        "trackName": "Unwound",
        "writer": "Dean Dillon, Frank Dycus",
        "duration": "2:24"
      },
      {
        "trackNumber": "2",
        "trackName": "Honky Tonk Downstairs",
        "writer": "Dallas Frazier",
        "duration": "2:31"
      },
      {
        "trackNumber": "3",
        "trackName": "Blame It on Mexico",
        "writer": "Darryl Staedtler",
        "duration": "2:45"
      },
      {
        "trackNumber": "4",
        "trackName": "If You're Thinking You Want a Stranger (There's One Coming Home)",
        "writer": "Blake Mevis, David Wills",
        "duration": "2:55"
      },
      {
        "trackNumber": "5",
        "trackName": "I Get Along with You",
        "writer": "Dean Dillon, Frank Dycus, Murray F. Cannon, Raleigh Squires, Jimmy Darrell",
        "duration": "2:40"
      },
      {
        "trackNumber": "6",
        "trackName": "Down and Out",
        "writer": "Dean Dillon, Frank Dycus",
        "duration": "2:23"
      },
      {
        "trackNumber": "7",
        "trackName": "Friday Night Fever",
        "writer": "Dean Dillon, Frank Dycus, Blake Mevis",
        "duration": "2:27"
      },
      {
        "trackNumber": "8",
        "trackName": "Every Time You Throw Dirt on Her (You Lose a Little Ground)",
        "writer": "Michael Garvin, Tom Shapiro",
        "duration": "3:05"
      },
      {
        "trackNumber": "9",
        "trackName": "She's Playing Hell Trying to Get Me to Heaven",
        "writer": "Dean Dillon, David Wills, Charles Quillen",
        "duration": "2:39"
      },
      {
        "trackNumber": "10",
        "trackName": "Her Goodbye Hit Me in the Heart",
        "writer": "Dean Dillon, Frank Dycus",
        "duration": "3:02"
      }
    ]
  },
  {
    "id": 26,
    "entryNumber": "00026",
    "artist": "Carly Rae Jepsen",
    "album": "EMOTION",
    "yearReleased": "2015",
    "genre": "Pop",
    "subGenre": "Synthpop, Dance-pop",
    "image": "crj.png",
    "puremood": "Radio",
    "season": "Summer",
    "party": "Yes",
    "lyric": "You're stuck in my head, stuck on my heart stuck in my body, body",
    "review": "I respect the hell out of Carly Rae Jepsen. She released one of the catchiest songs of the 21st century with Call Me Maybe, essentially went into obscurity after that and then released a pop album so good, that even metal heads love it. Then, she went and got Tom Hanks to be in her music video for I Really Like You, released a B-side for EMOTION that's almost as good as the proper album and continued by digging a substantial fanbase with 3 other great to good albums. She is a fighter. She probably could have lived on her residuals off of Call Me, Maybe (although the music industry does have a way of financially sucking the life out of a song for their own pockets, leaving the artist destitute which is super cool) but she, I assume, does it for the love of the game. And yet, when I mention her to most people, she is still the Call Me, Maybe girl. her drive is admirable but I am confounded that she isn't one of the biggest pop stars going right now. I know a lot of what makes a pop star a genuine pop star is great publicity and management and maybe she isn't getting the proper support but at that point I am just being an armchair pop culture dweeb... but come on, man! This album is filled with banger after banger after banger, it's cute but does get a bit risqué at times, the album cover is eye-catching and the fucking saxophone on Run Away With Me would make M83 blush. But I bet she is having a good time and I suppose being the most popular pop star probably comes with a lot of mental and social anxieties that she would smartly want to avoid. I think the entire thing, overall, is a failure of the poptimism experiment set out by the likes of Pitchfork to commodify pop music more than it was. It was supposed to accept pop as a pure, good form of music again which, hell yeah dude... I am all for. But I think it went too far with other lesser pop artists that I will not name got the golden ticket and sadly, (or happily, I guess if you are Carly and prefer to stay at her current level) left one of the best pop artists of the last 10 years to be the Call Me Maybe girl to your office co-workers.",
    "tracks": [
      {
        "trackNumber": "1",
        "trackName": "Run Away with Me",
        "writer": "Carly Rae Jepsen, Robin Lennart Fredriksson, Mattias Larsson, Oscar Holter",
        "duration": "4:11"
      },
      {
        "trackNumber": "2",
        "trackName": "E•MO•TION",
        "writer": "Carly Rae Jepsen, Josh Ramsay, Tavish Crowe",
        "duration": "3:17"
      },
      {
        "trackNumber": "3",
        "trackName": "I Really Like You",
        "writer": "Carly Rae Jepsen, Jacob Kasher, Peter Svensson",
        "duration": "3:24"
      },
      {
        "trackNumber": "4",
        "trackName": "Gimmie Love",
        "writer": "Carly Rae Jepsen, Rami Yacoub, Carl Falk",
        "duration": "3:22"
      },
      {
        "trackNumber": "5",
        "trackName": "All That",
        "writer": "Carly Rae Jepsen, Devonté Hynes",
        "duration": "4:37"
      },
      {
        "trackNumber": "6",
        "trackName": "Boy Problems",
        "writer": "Carly Rae Jepsen, Sia Furler, Greg Kurstin",
        "duration": "3:41"
      },
      {
        "trackNumber": "7",
        "trackName": "Making the Most of the Night",
        "writer": "Carly Rae Jepsen, Sia Furler, Greg Kurstin",
        "duration": "3:59"
      },
      {
        "trackNumber": "8",
        "trackName": "Your Type",
        "writer": "Carly Rae Jepsen, Rami Yacoub, Carl Falk",
        "duration": "3:19"
      },
      {
        "trackNumber": "9",
        "trackName": "Let's Get Lost",
        "writer": "Carly Rae Jepsen, Tegan Quin, Sara Quin",
        "duration": "3:13"
      },
      {
        "trackNumber": "10",
        "trackName": "LA Hallucinations",
        "writer": "Carly Rae Jepsen, Sia Furler, Samuel Dixon",
        "duration": "3:04"
      },
      {
        "trackNumber": "11",
        "trackName": "Warm Blood",
        "writer": "Carly Rae Jepsen, Rostam Batmanglij, Tino Zolfo",
        "duration": "4:13"
      },
      {
        "trackNumber": "12",
        "trackName": "When I Needed You",
        "writer": "Carly Rae Jepsen, Peter Svensson",
        "duration": "3:41"
      }
    ]
  },
  {
    "id": 27,
    "entryNumber": "00027",
    "artist": "Sade",
    "album": "Diamond Life",
    "yearReleased": "1984",
    "genre": "Sophisti-Pop",
    "subGenre": "Smooth Soul, Jazz Pop",
    "image": "sade.png",
    "puremood": "Lab",
    "season": "Autumn",
    "party": "No",
    "lyric": "See the people fussin' and thievin' while the sharks are wheelin' and dealin'",
    "review": "Tonight, I grilled burgers. I didn't have anyone over and just wanted to grill. It felt nice out, I have the house to myself, I have a couple of Miller Lite Tall boys and ran 4 miles/walked 3 miles today. So why not? You gotta spend your days like a good burger meat: 80 on the move, 20 doing the stuff you love. I listened to Steely Dan, George Benson, Tortoise and 'Diamond Life' by Sade. So I am sorry to anyone walking by who thought I was smashing anyone's meat. It was my own. Wait, I mean it was my own meat I bought at the store. Sade is synonymous with getting busy. I don't think I am old enough, or maybe I wasn't paying attention, to when that became the narrative. Yes, she writes very romantic and sexually charged music but so do a lot of artists and none of them get the label of music to make love to. What I am getting at is her stuff is so much more. It's very smart, well-crafted Sophisti-pop with catchy hooks bleeding out of its pores. 'Smooth Operator' is always the obvious go-to with Sade but for good reason... have you heard that sax solo? It's crazy. But this thing is loaded with classics whether or not they became a hit: 'Your Love is King', 'Frankie's First Affair', 'Cherry Pie'... okay, now that I list those song titles out like that, maybe I totally get where her music got the title of bangin' music. But if this album isn't an album you have actually sat and listened to, do yourself a favor and get your mind out of the gutter. Sure, there are tracks about love and affairs and love afairs but you also have songs like When Am I Going to Make a Living which is all about following your dreams and digging deep to meet the hunger inside of you. Then there is Sally which I think is about interacting day to day with those in need. It definitely ain't about boning. Check it out. A lot of great tunes are waiting for you on a bed of roses with wine or whatever you creeps do.",
    "tracks": [
      {
        "trackNumber": "1",
        "trackName": "Smooth Operator",
        "writer": "Helen Adu, Ray St. John",
        "duration": "4:59"
      },
      {
        "trackNumber": "2",
        "trackName": "Your Love Is King",
        "writer": "Helen Adu, Stuart Matthewman",
        "duration": "3:41"
      },
      {
        "trackNumber": "3",
        "trackName": "Hang On to Your Love",
        "writer": "Helen Adu, Stuart Matthewman",
        "duration": "5:54"
      },
      {
        "trackNumber": "4",
        "trackName": "Frankie's First Affair",
        "writer": "Helen Adu, Stuart Matthewman",
        "duration": "4:24"
      },
      {
        "trackNumber": "5",
        "trackName": "When Am I Going to Make a Living",
        "writer": "Helen Adu, Stuart Matthewman",
        "duration": "3:25"
      },
      {
        "trackNumber": "6",
        "trackName": "Cherry Pie",
        "writer": "Helen Adu, Stuart Matthewman",
        "duration": "6:20"
      },
      {
        "trackNumber": "7",
        "trackName": "Sally",
        "writer": "Helen Adu, Paul Denman",
        "duration": "5:20"
      },
      {
        "trackNumber": "8",
        "trackName": "I Will Be Your Friend",
        "writer": "Helen Adu, Stuart Matthewman",
        "duration": "4:43"
      },
      {
        "trackNumber": "9",
        "trackName": "Why Can't We Live Together",
        "writer": "Timmy Thomas",
        "duration": "5:27"
      }
    ]
  },
  {
    "id": 28,
    "entryNumber": "00028",
    "artist": "Yo La Tengo",
    "album": "Painful",
    "yearReleased": "1993",
    "genre": "Indie Rock",
    "subGenre": "Noise Pop, Shoegaze",
    "image": "painful.jpg",
    "puremood": "Bedroom",
    "season": "Autumn",
    "party": "Yes",
    "lyric": "In the passing lane on 1 and 9, stuck in a sad, car stuck in drive",
    "review": "The hardest working band from New Jersey isn't the E Street Band. It's not Misfits, Kool & The Gang, Bouncing Souls, and it definitely isn't Bon Jovi. The hardest working band from New Jersey is Skid Row. Just Kidding. It's Yo La Tengo. Seventeen studio albums with little to no break, retaining what makes them special on each album while changing it up as much as they can and consistently being called the quintessential critic's band. And for good reason. The love and care that is shoveled into their albums is tantamount to the care a mother has for their child or a dog has for anything that's not the mailman. It's tough to pick a best Yo La Tengo album and that, of course, is a joke because it's Painful. I love most of their albums but Painful is just it. It takes every puzzle piece the band had been carving out up until then and puts them together to make a really nice picture of a fruit basket or a horse race. It's been a while since I put together a puzzle so you'll have to tell me if that's canon. The album seems to alternate between garage experimentation to wavy, hushed toned beauty. There are even two tracks - 'Big Day Coming' and 'Big Day Coming (Second Version)' that are essentially a balancing act to the entire tone of the record. I am always shocked when I remember this thing came out in 1993. The experimentation and near-perfect songwriting has led this album to feel like it came out this year. Like most of their output, it's timeless. And I dare you to write a song as good as 'I Heard You Looking'. You can't do it. There ain't no way in the entirety of life you can make your guitar sound as sweet and longing as that song does. And Georgia shines on this album with the extraordinary 'Nowhere Near'. Put this on your list of albums to listen to. Put this on your list of albums to buy. Put this on a mixtape, shove it into a bottle and throw it into the ocean so 300 years from now, our children will think they found God's full-length debut.",
    "tracks": [
      {
        "trackNumber": "1",
        "trackName": "Big Day Coming",
        "writer": "Yo La Tengo",
        "duration": "9:10"
      },
      {
        "trackNumber": "2",
        "trackName": "From a Motel 6",
        "writer": "Yo La Tengo",
        "duration": "4:43"
      },
      {
        "trackNumber": "3",
        "trackName": "Double Dare",
        "writer": "Yo La Tengo",
        "duration": "6:58"
      },
      {
        "trackNumber": "4",
        "trackName": "Superstar-Watcher",
        "writer": "Yo La Tengo",
        "duration": "5:25"
      },
      {
        "trackNumber": "5",
        "trackName": "Nowhere Near",
        "writer": "Yo La Tengo",
        "duration": "6:02"
      },
      {
        "trackNumber": "6",
        "trackName": "Sudden Organ",
        "writer": "Yo La Tengo",
        "duration": "2:42"
      },
      {
        "trackNumber": "7",
        "trackName": "A Worrying Thing",
        "writer": "Yo La Tengo",
        "duration": "4:52"
      },
      {
        "trackNumber": "8",
        "trackName": "I Was the Fool Beside You for Too Long",
        "writer": "Yo La Tengo",
        "duration": "9:24"
      },
      {
        "trackNumber": "9",
        "trackName": "The Whole of the Law",
        "writer": "Yo La Tengo",
        "duration": "4:50"
      },
      {
        "trackNumber": "10",
        "trackName": "Big Day Coming (Second Version)",
        "writer": "Yo La Tengo",
        "duration": "5:06"
      },
      {
        "trackNumber": "11",
        "trackName": "I Heard You Looking",
        "writer": "Yo La Tengo",
        "duration": "9:40"
      }
    ]
  },
  {
    "id": 29,
    "entryNumber": "00029",
    "artist": "Men I Trust",
    "album": "Oncle Jazz",
    "yearReleased": "2019",
    "genre": "Indie Pop",
    "subGenre": "Dream Pop, Sophisti-Pop",
    "image": "onclejazz.png",
    "puremood": "Bedroom",
    "season": "Summer",
    "party": "Yes",
    "lyric": "This country dog won’t die in the city",
    "review": "I have a rule about albums that are 'too long.' The length in question can vary by genre (Hardcore Punk albums will fare better below 30 minutes and Jazz albums tend to sit well just above 35 minutes) but there is still a rule: If I look at the running time of an album and I think 'goddamn dawg that is too long,' it gets minus 10 points right then and there. If I listen to the album and I love it, it gets plus 20 points. Long albums are a tricky beast, not only because of the time investment you are asking your fans to sink into your new concept album about whales dying or whatever you nerd ass rock stars like to sing about, but also it can be an indication that an artist is too indecisive to cut anything. That leads to the question: where is the quality control? Am I going to get 12 solid good-to-great songs and 5 clunkers? It's very possible. And when that happens, well then the lord has forsaken us on this day. Oncle Jazz by Men I Trust is certainly an album that was chipped 10 points but after a couple of listens, it earned those 10 back doubled. Then, after a few more listens, the thing became essential. This album is infinitely charming. It takes what Mac Demarco started and runs it directly into the end zone. This album sounds like it was sat in the sun for a weekend in the best way. It's woozy, pretty, very catchy, and a heartrate reducer. This is the glass of wine of albums. This past weekend, I went to Florida to visit my grandparents and while my grandma and I were sitting on her back porch shooting the shit about this and that, I had this playing on my phone. She was even tapping her toes to it. I hate the word 'vibe' because it's become a placeholder for hundreds of colorful words these days but this album is truly a vibe.",
    "tracks": [
      {
        "trackNumber": "1",
        "trackName": "Oncle Jazz",
        "writer": "",
        "duration": "0:57"
      },
      {
        "trackNumber": "2",
        "trackName": "Norton Commander (Album V)",
        "writer": "",
        "duration": "3:26"
      },
      {
        "trackNumber": "3",
        "trackName": "Days Go By",
        "writer": "",
        "duration": "3:17"
      },
      {
        "trackNumber": "4",
        "trackName": "Tailwhip (Album V)",
        "writer": "",
        "duration": "3:48"
      },
      {
        "trackNumber": "5",
        "trackName": "Found Me",
        "writer": "",
        "duration": "3:31"
      },
      {
        "trackNumber": "6",
        "trackName": "Numb (Album V)",
        "writer": "",
        "duration": "3:39"
      },
      {
        "trackNumber": "7",
        "trackName": "Say Can You Hear (Album V)",
        "writer": "",
        "duration": "3:09"
      },
      {
        "trackNumber": "8",
        "trackName": "All Night",
        "writer": "",
        "duration": "3:08"
      },
      {
        "trackNumber": "9",
        "trackName": "I Hope to Be Around (Album V)",
        "writer": "",
        "duration": "3:26"
      },
      {
        "trackNumber": "10",
        "trackName": "Dorian",
        "writer": "",
        "duration": "2:51"
      },
      {
        "trackNumber": "11",
        "trackName": "Pines",
        "writer": "",
        "duration": "3:42"
      },
      {
        "trackNumber": "12",
        "trackName": "Slap Pie",
        "writer": "",
        "duration": "2:19"
      },
      {
        "trackNumber": "13",
        "trackName": "Fiero GT",
        "writer": "",
        "duration": "0:51"
      },
      {
        "trackNumber": "14",
        "trackName": "Seven (Album V)",
        "writer": "",
        "duration": "3:45"
      },
      {
        "trackNumber": "15",
        "trackName": "Show Me How (Album V)",
        "writer": "",
        "duration": "3:35"
      },
      {
        "trackNumber": "16",
        "trackName": "Alright",
        "writer": "",
        "duration": "2:37"
      },
      {
        "trackNumber": "17",
        "trackName": "You Deserve This (Album V)",
        "writer": "",
        "duration": "3:05"
      },
      {
        "trackNumber": "18",
        "trackName": "Pierre",
        "writer": "",
        "duration": "3:26"
      },
      {
        "trackNumber": "19",
        "trackName": "Air",
        "writer": "",
        "duration": "3:14"
      },
      {
        "trackNumber": "20",
        "trackName": "Porcelain",
        "writer": "",
        "duration": "3:32"
      },
      {
        "trackNumber": "21",
        "trackName": "Poodle of Mud",
        "writer": "",
        "duration": "1:19"
      },
      {
        "trackNumber": "22",
        "trackName": "Something in Water",
        "writer": "",
        "duration": "3:18"
      },
      {
        "trackNumber": "23",
        "trackName": "Tailwhip Revisited",
        "writer": "",
        "duration": "4:00"
      },
      {
        "trackNumber": "24",
        "trackName": "Poplar Tree",
        "writer": "",
        "duration": "1:14"
      }
    ]
  },
  {
    "id": 30,
    "entryNumber": "00030",
    "artist": "Grover Washington Jr.",
    "album": "Winelight",
    "yearReleased": "1980",
    "genre": "Jazz",
    "subGenre": "Smooth Jazz",
    "image": "winelight.jpg",
    "puremood": "Lab",
    "season": "Winter",
    "party": "Yes",
    "lyric": "Good things might come to those who wait not for those who wait too late. We gotta go for all we know",
    "review": "Once you are past the age of 16, I think the feeling Christmas gives you goes away. You know that feeling. You all have pictures your parents took when you were like 9 opening a present, and it's a video game for a console you don't own. You tell them you have a different console and while you appreciate the thought, it's kind of a bummer you can't play Mario 64 because all you have is an SNES. But then, there is another present and it's very much Nintendo 64 shaped. You open it like it owes you money... maybe you rip apart the wrapping paper so feverishly that you are still picking out small pieces of that paper from your fingernails to this day. You finally see the box behind the paper and... it's a shoebox. But! In that shoebox is a treasure map. And where that map leads you is to your neighbor's house. And she is 90 years old and when you approach your aging neighbor who once told you not to get too close to her tree because it may fall on your head and in turn sue her even though you would be dead as shit, she hands you another gift. You rip that bad boy open and it's a Nintendo 64! Maybe that was just my experience. But that's what Christmas does to a child. It gives you the feeling of discovery. That goes away. Sorry to any 10-year-olds reading this review for a smooth jazz record but it's true. But what if I told you that you can find that feeling again in incredibly expensive hobbies that will over-encumber your living quarters? Today, I went to my local favorite record shop with my best pal of 30 plus years and I found a copy of Winelight by Grover Washington Jr. for only 6 dollars and I felt a bit of that Christmas feeling again. Sure, it's smooth jazz and some of you haters out there might still write off the genre as music for the Weather Channel and elevators but I am here to tell you that there is so much more to offer in the genre. There is so much more to offer on this monster of an album. The album sounds like it was recorded inside of a well-kept watch. I dare you to put this on and not spend the first side grooving as if your life depended on it. Also, the penultimate track is none other than Will Smith's sampled \"Just the Two of Us\" featuring Bill Withers. Maybe I am overcalculating how excited I am over this find but I gotta say that knowing the particular copy of this barn burner of an album is just now getting its first spin after 40 plus years makes me giddy. I hope all of you find your N64 one day in the wasteland of adulthood.",
    "tracks": [
      {
        "trackNumber": "1",
        "trackName": "Winelight",
        "writer": "Grover Washington Jr.",
        "duration": "5:27"
      },
      {
        "trackNumber": "2",
        "trackName": "Let It Flow (For Dr. J)",
        "writer": "Grover Washington Jr.",
        "duration": "5:51"
      },
      {
        "trackNumber": "3",
        "trackName": "In the Name of Love",
        "writer": "Grover Washington Jr.",
        "duration": "5:23"
      },
      {
        "trackNumber": "4",
        "trackName": "Take Me There",
        "writer": "Grover Washington Jr.",
        "duration": "6:17"
      },
      {
        "trackNumber": "5",
        "trackName": "Just the Two of Us",
        "writer": "Grover Washington Jr., William Salter, Ralph MacDonald",
        "duration": "7:23"
      },
      {
        "trackNumber": "6",
        "trackName": "Make Me a Memory (Sad Samba)",
        "writer": "Grover Washington Jr.",
        "duration": "6:32"
      }
    ]
  },
  {
    "id": 31,
    "entryNumber": "00031",
    "artist": "Al Green",
    "album": "I'm Still In Love With You",
    "yearReleased": 1972,
    "genre": "Soul",
    "subGenre": "R&B",
    "image": "algreen.jpg",
    "puremood": "Cookout",
    "season": "Spring",
    "party": "Yes",
    "lyric": "How much did they cost? I don't know but that's the price you'll have to pay",
    "review": "Sometimes, an album embodies a season. I am obviously obsessed with that idea since each album I add to this godforsaken site has a season tag attached to it. But I think it's an important descriptor. Unless you live somewhere that is a certain temperature year-round, seasons can affect your overall demeanor. I have several friends who seem to only enjoy Autumn and Winter and dread the warmer months. Myself, I used to abhor Winter but 2 years ago, I decided to embrace it and now I just see it as a short period where I am freezing my bones off. It also helps that global warming is making the colder months a bit more mild, but I don't think that's something we will be able to enjoy for much longer. Either way, what the weather report says will set the tempo for a day half the time. That all being said, 'I'm Still In Love With You' by Al Green is the sound of a bird chirping and a flower blooming. When I listen to this album, I am immediately transported to the first day you can drive around with the windows down, the first time that year you can forget the hoodie or jacket before leaving the house and life just seems a little more hopeful. I think a lot of this can be attributed to how bright the album sounds but also how sparse the instrumentation is. This isn't an album that's overtly busy with horns and Rhodes keyboards or backing vocals. It truly sounds like Mr. Green woke up one day and it was 75 degrees and he decided to open the doors and windows, light up a cigarette, crack open a light beer and play music while the breeze whipped over his face. If there was an award for 'Albums perfect for an empty bar on a warm Sunday Afternoon,' then this would be right there with 'Alien Lanes' by Guided By Voices.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "I'm Still In Love With You",
        "writer": "Al Green, Al Jackson Jr., Willie Mitchell",
        "duration": "3:12"
      },
      {
        "trackNumber": 2,
        "trackName": "I'm Glad You're Mine",
        "writer": "Al Green",
        "duration": "2:59"
      },
      {
        "trackNumber": 3,
        "trackName": "Love and Happiness",
        "writer": "Al Green, Mabon \"Teenie\" Hodges",
        "duration": "5:03"
      },
      {
        "trackNumber": 4,
        "trackName": "What a Wonderful Thing Love Is",
        "writer": "Al Green, Willie Mitchell",
        "duration": "3:37"
      },
      {
        "trackNumber": 5,
        "trackName": "Simply Beautiful",
        "writer": "Al Green",
        "duration": "4:11"
      },
      {
        "trackNumber": 6,
        "trackName": "Oh, Pretty Woman",
        "writer": "A.C. Williams",
        "duration": "3:24"
      },
      {
        "trackNumber": 7,
        "trackName": "For the Good Times",
        "writer": "Kris Kristofferson",
        "duration": "6:26"
      },
      {
        "trackNumber": 8,
        "trackName": "Look What You Done for Me",
        "writer": "Al Green, Al Jackson Jr., Willie Mitchell",
        "duration": "3:05"
      },
      {
        "trackNumber": 9,
        "trackName": "One of These Good Old Days",
        "writer": "Al Green",
        "duration": "3:23"
      },
      {
        "trackNumber": 10,
        "trackName": "Georgia Boy",
        "writer": "Al Green, Charles Hodges",
        "duration": "3:38"
      }
    ]
  },
  {
    "id": 32,
    "entryNumber": "00032",
    "artist": "2814",
    "album": "Birth of a New Day (新しい日の誕生)",
    "yearReleased": 2015,
    "genre": "Vaporwave",
    "subGenre": "Ambient, Electronic",
    "image": "2814.jpg",
    "puremood": "Airport",
    "season": "Winter",
    "party": "no",
    "lyric": "------",
    "review": "There are 3 certainties in this life: Death, Taxes, and a dark night of the soul. You will die, you probably maybe should file and pay your taxes, and you have been awake at 3 am wondering what it's all about. I know based on what you have read on No Static, you would assume I am a perfect human who doesn't need to pay taxes or die. But I am here to tell you that isn't true. As a matter of fact, I have had my fair share of dark nights of the soul as well. When that happens to me, I try to get some sleep or reach out to another night owl friend. If neither of those works, I go searching for new music. I think the routine itself puts me at ease, and for added bonus points, I get to find new music. Most of the time, I will find stuff that I am okay with or get a better understanding of an artist or a genre... but sometimes, I find something special. In walks 2814's 'Birth of a New Day' (新しい日の誕生). This is an ambient vaporwave album from a couple of vaporwave musicians who have some pretty great albums in their own right, both as their solo monikers (HKE and Telepath) and as 2814. But this one waves in the wind like tears in the rain. I am not sure what that means, but instead of trying to force inject meaning into something 'waving in the wind like tears in the rain,' I can just say that this is an album that the extras in Blade Runner would probably listen to. It's one of those moments in music where the album cover gets the sound and tone 100% right. The opening track itself is enough to convince any fan of ambient, vaporwave, or even someone who needs to feel weightless at 3 am for a few minutes. The album lumbers by but sends you to another world. It's a remarkable achievement in how an album can move you, even if the album is moving at a snail's pace.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "恢复",
        "writer": "",
        "duration": "5:51"
      },
      {
        "trackNumber": 2,
        "trackName": "遠くの愛好家",
        "writer": "",
        "duration": "6:18"
      },
      {
        "trackNumber": 3,
        "trackName": "新宿ゴールデン街",
        "writer": "",
        "duration": "8:51"
      },
      {
        "trackNumber": 4,
        "trackName": "ふわっと",
        "writer": "",
        "duration": "6:36"
      },
      {
        "trackNumber": 5,
        "trackName": "悲哀",
        "writer": "",
        "duration": "9:23"
      },
      {
        "trackNumber": 6,
        "trackName": "真実の恋",
        "writer": "",
        "duration": "7:12"
      },
      {
        "trackNumber": 7,
        "trackName": "テレパシー",
        "writer": "",
        "duration": "10:08"
      },
      {
        "trackNumber": 8,
        "trackName": "新しい日の誕生",
        "writer": "",
        "duration": "13:04"
      }
    ]
  },
  {
    "id": 33,
    "entryNumber": "00033",
    "artist": "Fennesz",
    "album": "Venice",
    "yearReleased": 2004,
    "genre": "Ambient",
    "subGenre": "Electronic, Glitch",
    "image": "venice.jpg",
    "puremood": "Airport",
    "season": "Winter",
    "party": "No",
    "lyric": "Do you fear what I fear?",
    "review": "When best pal of 30 plus years TJ and I were in college, we would both have short days on Tuesdays, and if I recall correctly, we would also both be off of work. So, after our two morning classes, we would head over to Best Buy to pick up some new music. For anyone who is appalled by us supporting a big box chain, keep in mind that this was 2004-2005, and while we had record stores, Best Buy had prices that were in favor of our bank accounts. We both now primarily shop at local record stores. Please for the love of god DO NOT hurt us, Hammer. But another draw Best Buy had in those days was this computer connected to some music database that would allow you to search for albums and preview the tracks. So, we would pick up what we came there for and find albums with interesting enough album covers to preview. Bonus points if there was a hype sticker that said 'rocks like The Mars Volta' or something. Sometimes we would find some real clunkers, sometimes we would find some real winners. I think the biggest win that comes to mind for both of us is the debut album for The Format called 'Inventions + Lullabies'. This practice is still something we both do but nowadays for the sake of money and space in our record collections, this is done via music streaming apps. While your Spotifys and Pandoras are more convenient these days, the magic is sort of lost. Now, we essentially can automate our tastes and ensure we are going to at least really like a release before spending 15 - 30 bucks on it. All this to say that 'Venice' by Fennesz is one of these albums for me. Did you see that album cover?! Jesus Christ, man. It's so serene and peaceful. I want to live inside of that album cover. I want to be one of those boats, drifting away to god knows where, waving back and forth like a dipshit in the ocean. The music certainly matches this feeling. Layered guitars with tons of effect pedals to the point where they sound unlike any stringed instrument and instead sound like a boat drifting freely nowhere. And outside of one track with vocals (Transit feat. David Sylvian) that's really this entire album. But its end goal, if I were to hazard a guess, is to put you in that painting on the cover. The world is full of stress and this album begs that sometimes, you can put something on and leave the world just for a little while. Also, TJ and I would go to Subway after our Best Buy trips back when a footlong of food would be within your grubby little hands for 5 dollars and some tax. So, I figured that would be worth noting to outline what my formative years were truly about.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Rivers of Sand",
        "writer": "",
        "duration": "4:42"
      },
      {
        "trackNumber": 2,
        "trackName": "Château Rouge",
        "writer": "",
        "duration": "6:40"
      },
      {
        "trackNumber": 3,
        "trackName": "City of Light",
        "writer": "",
        "duration": "6:34"
      },
      {
        "trackNumber": 4,
        "trackName": "Onsra",
        "writer": "",
        "duration": "0:20"
      },
      {
        "trackNumber": 5,
        "trackName": "Circassian",
        "writer": "",
        "duration": "5:49"
      },
      {
        "trackNumber": 6,
        "trackName": "Onsay",
        "writer": "",
        "duration": "1:08"
      },
      {
        "trackNumber": 7,
        "trackName": "The Other Face",
        "writer": "",
        "duration": "3:25"
      },
      {
        "trackNumber": 8,
        "trackName": "Transit (feat. David Sylvian)",
        "writer": "",
        "duration": "4:59"
      },
      {
        "trackNumber": 9,
        "trackName": "The Point of It All",
        "writer": "",
        "duration": "5:01"
      },
      {
        "trackNumber": 10,
        "trackName": "Laguna",
        "writer": "",
        "duration": "2:56"
      },
      {
        "trackNumber": 11,
        "trackName": "Asusu",
        "writer": "",
        "duration": "0:55"
      },
      {
        "trackNumber": 12,
        "trackName": "The Stone of Impermanence",
        "writer": "",
        "duration": "6:37"
      }
    ]
  },
  {
    "id": 34,
    "entryNumber": "00034",
    "artist": "Altar of Plagues",
    "album": "Teethed Glory and Injury",
    "yearReleased": 2013,
    "genre": "Metal",
    "subGenre": "Atmospheric Black Metal",
    "image": "altar.jpg",
    "puremood": "Basement",
    "season": "Winter",
    "party": "No",
    "lyric": "The stones let me go, but to make a difference their names are kept",
    "review": "One of my favorite movie discoveries of my early years was finding a copy of The Commitments on DVD at Meijer. I didn't know anything about it but its front focus was music so I picked it up because that's what you did pre-everything streaming. If something caught your eye, you grabbed it and hoped it wasn't Paul Shore is Dead quality. The movie is about a large group of working-class Irish 20-somethings looking to do something important with their lives so they start a blue-eyed soul group covering some of the greatest soul cuts you can imagine. It's incredibly funny and charming. I seriously recommend it as an overlooked music-focused movie. It even has a guy from the Irish indie rock band The Frames by the name of Glen Hansard who later went on to write the music for the movie Once. Very talented cast. The reason I bring this movie up, this charming, funny romp of a cult classic is because the Irish can sometimes bring the darkness. In walks Altar of Plagues with their swinging dick of an album Teethed Glory and Injury. Altar of Plagues is an Atmospheric Black Metal band and in case you missed it, the album cover is clearly very terrifying to look at. What is that guy doing? It ain't yoga; I ain't ever seen anyone doing that in a yoga class. This thing is loaded with terror and when the band does let up a bit to sound like an Unwound rip-off, they come back at you with a black wall of oozing noise, deeper and darker than, well, a black wall of ooze would be, I suppose. But what makes this special from other Black Metal projects is their commitment (heh like the movie I mentioned earlier) to packaging that chaos into something complex and almost avant-garde. I mean, I feel like you could get a jazz group to deconstruct these tracks and cover this album but turn it into something Pharaoh Sanders would be proud of. But it certainly isn't short of pure aggression. Take the song 'Burnt Year,' which starts as what sounds like what might be the most docile track on the album thus far but immediately converts into a banging thump only the devil could do on his best day. It is highly suggested that you listen to this one very loudly and where there is visible sunlight. This is a spooky scary one.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Mills",
        "writer": "",
        "duration": "4:08"
      },
      {
        "trackNumber": 2,
        "trackName": "God Alone",
        "writer": "",
        "duration": "4:25"
      },
      {
        "trackNumber": 3,
        "trackName": "A Body Shrouded",
        "writer": "",
        "duration": "4:59"
      },
      {
        "trackNumber": 4,
        "trackName": "Burnt Year",
        "writer": "",
        "duration": "4:40"
      },
      {
        "trackNumber": 5,
        "trackName": "A Remedy and a Fever",
        "writer": "",
        "duration": "8:43"
      },
      {
        "trackNumber": 6,
        "trackName": "Twelve Was Ruin",
        "writer": "",
        "duration": "4:33"
      },
      {
        "trackNumber": 7,
        "trackName": "Scald Scar of Water",
        "writer": "",
        "duration": "6:54"
      },
      {
        "trackNumber": 8,
        "trackName": "Found, Oval and Final",
        "writer": "",
        "duration": "3:19"
      },
      {
        "trackNumber": 9,
        "trackName": "Reflection Pulse Remains",
        "writer": "",
        "duration": "6:17"
      }
    ]
  },
  {
    "id": 35,
    "entryNumber": "00035",
    "artist": "Mobb Deep",
    "album": "The Infamous",
    "yearReleased": 1995,
    "genre": "Hip Hop",
    "subGenre": "Boom Bap",
    "image": "infamous.png",
    "puremood": "Basement",
    "season": "Autumn",
    "party": "Yes",
    "lyric": "I got you stuck off the realness, we be the infamous. You heard of us, official Queensbridge murderers",
    "review": "First and foremost, RIP Prodigy. I try not to get too bent out of shape about a musician dying because, let's face it, I highly doubt Prodigy, Lou Reed, Bob Stinson, Alex Chilton, or Adam Schlesinger knew who I was. And if they did, well, that's weird because I am just a guy. But seriously, RIP Prodigy. It's a wonder when artists as young as the aforementioned Prodigy and Havoc are when they make something bigger than themselves. When I was their age, I was eating five-dollar footlongs and taking naps. And these dudes make a defining east coast hip hop album?! No, an important hip hop album, full stop. No, let's not split hairs... this is essential no matter how you cut it. If 36 Chambers walked right into a new sound, then Mobb Deep's The Infamous took that new sound and ran it right into the end zone, threw the ball directly into the ground so hard that only that dork in The Sword in the Stone could remove it. I think something that one of the many components that makes hip hop such a great genre of music is its energy. The best hip hop albums out there have this perpetual motion to them that doesn't let up. The opener in the hand holding the metal ball, letting it go and the rest of the album is constantly trading energy back and forth back and forth and back and forth over and over never letting up. It's often why the so-called 'lyrical miracle' stuff doesn't always work for me. The lyrics are there, sure, but the energy is an overthought, traded in for how fast they can rap and how many ten-dollar words they can stuff in it. Not to say this album has a lack of lyrical sharpness. 'God bless my soul before I put my foot down and begin to stroll into the drama I built and all unfinished beef, you will soon be killed', 'A dead man walking, not only that, he's still talking about how and what he did very often. You don't know how much I fiend to put his ass in a coffin' and 'Pour some beer for the ill, ain't no time to chill. Hit 'em up, 'cause I'm quick to erupt like dicks. Wet 'em up with the MAC, scratch 'em off my list'. Ok, that last one was for me. But that's why this album is one I come back to time and time again: It's fun, it's complex, and good lord does it still sound as if it came out yesterday. To my knowledge, this album never got a remaster or anything which is a testament to how much heart and care went into making this. RIP Prodigy.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "The Start of Your Ending (41st Side)",
        "duration": "4:24"
      },
      {
        "trackNumber": 2,
        "trackName": "(The Infamous Prelude)",
        "duration": "2:12"
      },
      {
        "trackNumber": 3,
        "trackName": "Survival of the Fittest",
        "duration": "3:44"
      },
      {
        "trackNumber": 4,
        "trackName": "Eye for a Eye (Your Beef Is Mines) feat. Nas, Raekwon The Chef",
        "duration": "4:48"
      },
      {
        "trackNumber": 5,
        "trackName": "(Just Step Prelude)",
        "duration": "1:06"
      },
      {
        "trackNumber": 6,
        "trackName": "Give Up the Goods (Just Step) feat. Big Noyd",
        "duration": "4:03"
      },
      {
        "trackNumber": 7,
        "trackName": "Temperature's Rising feat. Crystal Johnson",
        "duration": "5:00"
      },
      {
        "trackNumber": 8,
        "trackName": "Up North Trip",
        "duration": "4:58"
      },
      {
        "trackNumber": 9,
        "trackName": "Trife Life",
        "duration": "5:20"
      },
      {
        "trackNumber": 10,
        "trackName": "Q.U. - Hectic",
        "duration": "4:46"
      },
      {
        "trackNumber": 11,
        "trackName": "Right Back at You feat. Ghostface Killah, Raekwon, Big Noyd",
        "duration": "4:53"
      },
      {
        "trackNumber": 12,
        "trackName": "(The Grave Prelude)",
        "duration": "0:50"
      },
      {
        "trackNumber": 13,
        "trackName": "Cradle to the Grave",
        "duration": "4:57"
      },
      {
        "trackNumber": 14,
        "trackName": "Drink Away the Pain (Situations) feat. Q-Tip",
        "duration": "4:45"
      },
      {
        "trackNumber": 15,
        "trackName": "Shook Ones, Pt. II",
        "duration": "5:25"
      },
      {
        "trackNumber": 16,
        "trackName": "Party Over feat. Big Noyd",
        "duration": "5:41"
      }
    ]
  },
  {
    "id": 36,
    "entryNumber": "00036",
    "artist": "Black Sabbath",
    "album": "Master of Reality",
    "yearReleased": 1971,
    "genre": "Metal",
    "subGenre": "Doom Metal",
    "image": "masters.png",
    "puremood": "Basement",
    "season": "Autumn",
    "party": "Yes",
    "lyric": "Will love you, sweet leaf",
    "review": "Reality television's popularity offers a fascinating glimpse into the human condition. From its inception with shows like Real World and Road Rules to its explosion with Survivor, it's intriguing to unravel its emotional grip on people. It's a genre of trash I'll truly never understand. I'm not a fan, and I'm not here to harp on the so-called harm it may have done to our society. While there may be some validity in those claims, it ultimately doesn't matter. Plenty of junk has come before, during, and since. I believe it's important to appreciate junky stuff. For instance, I often find myself mindlessly watching long-form YouTube essays made by people much younger than me, stretching a 10-minute topic into a 50-minute ordeal. I've even sat through a 2-hour video of an alpha dork dissecting a video game I've never played and why it's supposedly important. Or maybe it's not. I don't remember. The point is, sometimes we all need to switch off our brains. Reality TV is peculiar because, from the outset, it wasn't real. Shows like Nathan For You have a better track record when it comes to reality than any traditional reality TV show, as they openly acknowledge the extent to which they manipulate situations for optimal, unhinged reactions. Remember The Osbournes? That show about Ozzy Osbourne's family where Ozzy seemed like a brain-dead mess throughout? There's no way he was that far gone. For heaven's sake, Black Sabbath put out a return-to-form album in 2013 called '13' that was pretty great, and not once did Ozzy scream 'SHARRROOON'. Ozzy's commitment to the bit of having the brain function of a turkey sandwich is precisely what makes Sabbath so special. Metal, much like reality TV, often presents a facade of evil or devil adoration, when in reality, these musicians are just regular guys who love Dungeons and Dragons too much and probably smell like their parents' basement. The devil stuff is (mostly) fake, just like those dramatic moments in reality TV shows that make everyone gasp. But if there's one thing that truly embodies the reality of Sabbath, it's weed. They love it. Now, I'm not a weed guy, but I can't deny that Master of Reality exudes a haze that makes me feel like I was born inside a bong. That's its specialty. Did this album invent Stoner Metal? Maybe. Who knows? What I do know is that this album chugs along like a group of teenagers in a musty, old, stale basement trying to hide the smell of weed from their parents. And that's special. Good music sounds good. Great music sounds like an image, and this album sounds like it was made to live in a weed farm. I say this with sincerity and from the depths of my chest: if there's one metal record you listen to before shuffling off this mortal coil, let it be this one. Just relax on the reality TV. It's not that important.",
    "tracks": [
      {
        "trackNumber": 1,
        "trackName": "Sweet Leaf",
        "duration": "5:04"
      },
      {
        "trackNumber": 2,
        "trackName": "After Forever",
        "duration": "5:26"
      },
      {
        "trackNumber": 3,
        "trackName": "Embryo",
        "duration": "0:28"
      },
      {
        "trackNumber": 4,
        "trackName": "Children of the Grave",
        "duration": "5:17"
      },
      {
        "trackNumber": 5,
        "trackName": "Orchid",
        "duration": "1:30"
      },
      {
        "trackNumber": 6,
        "trackName": "Lord of This World",
        "duration": "5:25"
      },
      {
        "trackNumber": 7,
        "trackName": "Solitude",
        "duration": "5:01"
      },
      {
        "trackNumber": 8,
        "trackName": "Into the Void",
        "duration": "6:10"
      }
    ]
  }
]
