[
  {
    "nsrcId": "0001-NSRC",
    "artistEntry": "Steely Dan",
    "imageOne": "NSRC-steely-dan.jpg",
    "introParagraph": "With it being Dan Season and a Steely Dan lyric being the namesake of this entire website project, I thought it appropriate to make the first installment of the No Static Record Catalogue to be Steely Dan. The idea and motivations for the NSRC is two-fold: to fulfill some deep-seated dream of mine to own and run a record label, even if it is fake, and to demonstrate that no matter how close to perfection an artist can craft an album (in this case, Aja), there can always be a next level. I think every artist with a decent enough-sized discography has the potential to take, let's say 10 tracks, and craft the ultimate record. This is more than just a short playlist of my favorite songs from an artist, although a lot of the songs I am sure will be favorites of mine, but sometimes there is a clear direction for a made-up album in my mind and sometimes certain songs aren't going to fit. Take 'Do It Again', for instance. A true blue favorite of mine in the Dan-scography (sorry I won't do such a portmanteau again), it would stick out like a sore thumb along with the other tracks I would like to include.",
    "sideOneParagraph": "So first things first: I am going to need to pick a theme or a mood or a style, I guess, for this album. I always leaned more toward Steely Dan's late '70s, early '80s stuff. So, I think the album needs to fit that mold which means, sadly, Can't Buy A Thrill, Pretzel Logic, and Countdown to Ecstasy tracks aren't going to quite cut it. For the first track overall, I don't think you get any better than giving 'FM' the due its deserved. 'FM' was written for the movie of the same name and never saw an album release outside of best of comps. Also, it's a heavy opener. It gets you into the spirit of what's to come. As far as sequencing the tracks go, I always quite liked the big/small dichotomy, at least for the first side. What I mean is the opener is big and bright pop hit and then to sort of level out the mood and not burn out the listener, the 2nd track is a bit more subdued. So I think the 2nd track spot belongs firmly with Hey Nineteen which is a pop song in its own right but levels out the energy a bit. But then comes what may be my favorite Steely Dan song 'The Caves of Altamira'. This thing rips, man. The chorus is easily the best sing-along chorus written by the group and I think brings us back to a place of big and flashy just to remind the listeners that there are gonna be some stereo blasters on here. For the 4th track pick, I am going Black Cow. Now this is a hell of an opener on Aja but for this vibe, I feel like it's a good place right near the middle of the project due to its strut. It also gives the band some time to stretch their legs and meander a bit. Now to finish on Side A, I think there are few better fits than Time Out Of Mind. This could be, say the 2nd or 3rd Single on the album and a great way to finish off a killer side with its bouncy walk. I also like to think that at this point within this alternate reality, Michael McDonald has officially joined the group and he brought his buddy Mark Knopfler to play as long as he didn't say any slurs. Also the song has a stellar fade-out.",
    "sideTwoParagraph": "Onto Side B. I wanted to open this side with a barn burner with Peg. Remind em' who you are and cement McDonalds' newfound position in the band with his banshee scream. I also wanted to kick up the jazz influence on this side to give it some personality away from the more pop-adjacent Side A. Track two needs to continue that big/small dichotomy mentioned previously and how can't you include Babylon Sisters. You gotta give em an NYC in the '70s at midnight sound for the weirdos out there. Also, Peg into Babylon Sisters just feels right, ya know? And a Steely Dan album wouldn't feel whole without a song about a creepy pedo so Track 3 on Side B is Everyone's Gone To The Movies. The happiest song about someone you never want to meet. For the last two tracks, I wanted to include the track that becomes a hit maybe 10 years after the album's release, a sleeper if you will, and what I would think would be the first single on the album. First, for the sleeper, I am going with a Fagen solo track and some of his finest songwriting overall, 'I.G.Y.'. Now I know this isn't a Dan song but this is my fun little game and I will play however I want to, ok? As for the final track on the album and what I would envision as the first single, I am gonna close the album out with 'Deacon Blues'. I have always been fascinated with albums that put their first single at the end of the album, as if they are saying 'oh you want the hit? Well, first you are going to have to hear 9 other songs that are just as good.' Also, the song is the longest on this fake album which adds more reason to make it the first single because what is more Dan than that?",
    "nameAndImageParagraph": "Ok, the album is written, recorded, mastered and now we need a name. Steely Dan typically names their albums after a track on the album and after looking at the tracklist, I think the move is Time Out Of Mind. Like, I can imagine a record store clerk in the late '70s/early '80s playing this album over the speakers and a customer asking 'Hey... what is this?' and the clerk saying 'Oh this is the new Steely Dan album Time Out Of Mind... just came out.' As much as I hate to admit it, Steely Dan album covers have never wowed me. They are fine but certainly a product of their time. So I am going to grab some cool NYC pictures from the '80s off of Google and give em a black and white filter. Also, I am not a graphic designer so spending time on making the perfect album cover would be very frustrating and I have already spent my frustrations on the routing for the website.",
    "wrapUpparagraph": "And there you have it! Steely Dan's Time Out Of Mind. Go listen. Or not I don't care I am not your dad and never claimed to be.",
    "albumImageFront": "NSRC-steely-dan-front.png",
    "albumImageBack": "NSRC-steely-dan-back.png",
    "spotifyPlaylistLink": "https://open.spotify.com/embed/playlist/6U3vYpkLME0Qndv3p7Kogo?utm_source=generator"
  }
]
