[
  {
    "id": 1,
    "nsrcListing": "0001-NSRC",
    "artistEntry": "Steely Dan",
    "imageOne": "NSRC-steely-dan.jpg",
    "introParagraph": "With it being Dan Season and a Steely Dan lyric being the namesake of this entire website project, I thought it appropriate to make the first installment of the No Static Record Catalogue to be Steely Dan. The idea and motivations for the NSRC is two-fold: to fulfill some deep-seated dream of mine to own and run a record label, even if it is fake, and to demonstrate that no matter how close to perfection an artist can craft an album (in this case, Aja), there can always be a next level. I think every artist with a decent enough-sized discography has the potential to take, let's say 10 tracks, and craft the ultimate record. This is more than just a short playlist of my favorite songs from an artist, although a lot of the songs I am sure will be favorites of mine, but sometimes there is a clear direction for a made-up album in my mind and sometimes certain songs aren't going to fit. Take 'Do It Again', for instance. A true blue favorite of mine in the Dan-scography (sorry I won't do such a portmanteau again), it would stick out like a sore thumb along with the other tracks I would like to include.",
    "sideOneParagraph": "So first things first: I am going to need to pick a theme or a mood or a style, I guess, for this album. I always leaned more toward Steely Dan's late '70s, early '80s stuff. So, I think the album needs to fit that mold which means, sadly, Can't Buy A Thrill, Pretzel Logic, and Countdown to Ecstasy tracks aren't going to quite cut it. For the first track overall, I don't think you get any better than giving 'FM' the due its deserved. 'FM' was written for the movie of the same name and never saw an album release outside of best of comps. Also, it's a heavy opener. It gets you into the spirit of what's to come. As far as sequencing the tracks go, I always quite liked the big/small dichotomy, at least for the first side. What I mean is the opener is big and bright pop hit and then to sort of level out the mood and not burn out the listener, the 2nd track is a bit more subdued. So I think the 2nd track spot belongs firmly with Hey Nineteen which is a pop song in its own right but levels out the energy a bit. But then comes what may be my favorite Steely Dan song 'The Caves of Altamira'. This thing rips, man. The chorus is easily the best sing-along chorus written by the group and I think brings us back to a place of big and flashy just to remind the listeners that there are gonna be some stereo blasters on here. For the 4th track pick, I am going Black Cow. Now this is a hell of an opener on Aja but for this vibe, I feel like it's a good place right near the middle of the project due to its strut. It also gives the band some time to stretch their legs and meander a bit. Now to finish on Side A, I think there are few better fits than Time Out Of Mind. This could be, say the 2nd or 3rd Single on the album and a great way to finish off a killer side with its bouncy walk. I also like to think that at this point within this alternate reality, Michael McDonald has officially joined the group and he brought his buddy Mark Knopfler to play as long as he didn't say any slurs. Also the song has a stellar fade-out.",
    "sideTwoParagraph": "Onto Side B. I wanted to open this side with a barn burner with Peg. Remind em' who you are and cement McDonalds' newfound position in the band with his banshee scream. I also wanted to kick up the jazz influence on this side to give it some personality away from the more pop-adjacent Side A. Track two needs to continue that big/small dichotomy mentioned previously and how can't you include Babylon Sisters. You gotta give em an NYC in the '70s at midnight sound for the weirdos out there. Also, Peg into Babylon Sisters just feels right, ya know? And a Steely Dan album wouldn't feel whole without a song about a creepy pedo so Track 3 on Side B is Everyone's Gone To The Movies. The happiest song about someone you never want to meet. For the last two tracks, I wanted to include the track that becomes a hit maybe 10 years after the album's release, a sleeper if you will, and what I would think would be the first single on the album. First, for the sleeper, I am going with a Fagen solo track and some of his finest songwriting overall, 'I.G.Y.'. Now I know this isn't a Dan song but this is my fun little game and I will play however I want to, ok? As for the final track on the album and what I would envision as the first single, I am gonna close the album out with 'Deacon Blues'. I have always been fascinated with albums that put their first single at the end of the album, as if they are saying 'oh you want the hit? Well, first you are going to have to hear 9 other songs that are just as good.' Also, the song is the longest on this fake album which adds more reason to make it the first single because what is more Dan than that?",
    "nameAndImageParagraph": "Ok, the album is written, recorded, mastered and now we need a name. Steely Dan typically names their albums after a track on the album and after looking at the tracklist, I think the move is Time Out Of Mind. Like, I can imagine a record store clerk in the late '70s/early '80s playing this album over the speakers and a customer asking 'Hey... what is this?' and the clerk saying 'Oh this is the new Steely Dan album Time Out Of Mind... just came out.' As much as I hate to admit it, Steely Dan album covers have never wowed me. They are fine but certainly a product of their time. So I am going to grab some cool NYC pictures from the '80s off of Google and give em a black and white filter. Also, I am not a graphic designer so spending time on making the perfect album cover would be very frustrating and I have already spent my frustrations on the routing for the website.",
    "wrapUpparagraph": "And there you have it! Steely Dan's Time Out Of Mind. Go listen. Or not I don't care I am not your dad and never claimed to be.",
    "albumImageFront": "NSRC-steely-dan-front.png",
    "albumImageBack": "NSRC-steely-dan-back.png",
    "spotifyPlaylistLink": "https://open.spotify.com/embed/playlist/6U3vYpkLME0Qndv3p7Kogo?utm_source=generator"
  },
  {
    "id": 2,
    "nsrcListing": "0002-NSRC",
    "artistEntry": "Bob Dylan",
    "imageOne": "NSRC-dylan.jpg",
    "introParagraph": "This is gonna be a tough one. Bob Dylan has what like 90 albums? And 80 of them are good? Don't forget about all the rarities, b-sides and throwaways. But no matter, I am up for the challenge. Just like with Steely Dan, I am going to focus on a cohesive project that has a thru-line when it comes to mood, style and sound. I am going to focus on full band Dylan because... look... I get it. Those early albums are classics, essential even. But nothing beats Dylan with a full band. That also means albums like Nashville Skyline where he decided to change his voice are pretty much a non starter. But I do love that album and really really wish I could put Girl From Northy Country into consideration. But I digest...",
    "sideOneParagraph": "Side A Track 1 we want some energy and we definitely want Dylan laughing and sounding like he is having a good time. Maybe this album is his return to songwriting after he got into that supposed motorcycle wreck. Maybe he fell into a deep depression... a survivors guilt only to be pulled out of his by his loved ones, a quick vacation to France, some sun and a rekindled love of songwriting. Track 1 has to go to Bob Dylan's 115th Dream. He sounds happy, healthy and he is back telling some wild ass stories. He is honkin' on that harmonica and he is singing about traveling the world. How about this: the album could be about his horse riding accident and the depression or whatever and this is the last track recorded for the album to but demonstrate where he is now, its the first track. Like how a movie starts at the end and then takes you on a journey to show you how someone got there. Dylan is telling us that no matter how bad things could get, you'll be laughing and telling stories with friends again soon enough . From there, I think track 2 needs to dial back the energy just a bit but maybe not too much. I talked about my love of the big/small sequencing in the Steely Dan NSRC but I think here, we need to convey that Dylan ain't frickin around but lets not blow in the wind just yet. So track 2 goes to Stuck Inside of Mobile with the Memphis Blues Again. Its a continuation of his rambling about cities or whatever, it drops the tempo ever so slightly but keeps the road trip moving along. Also the ending of Stuck Inside leads nicely into track 3 with Like a Rolling Stone. Obviously, this is the lead off single. There isn't much I need to say about this song. You know it. I know it. And at this time, people are truly starting to think Dylan is back, baby. But we need some beauty to shine thru. Dylan has done some serious reflecting in his spaceship accident or whatever it was so coming in as track 4 is You're a Big Girl Now. This is when things start to turn sour. Dylan is thinking about the one that got away (in real life, this is off of Blood on the Tracks and is about his ex-wife but I have already said this album was written about a near death spaceship accident so you're just gonna have to suspend some disbelief for me). Dylan saying 'I can change, I swear' leads us into the last track of Side A, track 5 with Hurricane. This is the 2nd single and in my opinion, it might be Dylans finest moment. The song is about the imprisonment of Rubin 'Hurricane' Carter and Dylan's distaste for the acts of racism and profiling. So now Dylan is turning his energy to helping out those who need it. He is learning to be selfless.",
    "sideTwoParagraph": "And so ends Side A. Side B starts out with silence and fades in with Changing of the Guards. This could be months later. Some time has passed and we see Dylan jamming with some real pros here. Sure, there are so interesting gaffs in this song but it only contributes to its charm. It sounds like friends having a few drinks and doing what they do best. Track 2 on Side B goes right into The Man In Me, a song about boastfulness in front of weakness. He is getting a bit better but still hiding behind false confidence. That one who got away may have gotten away a while ago but he still thinks of her when he thinks about his fencing accident or whatever. Which leads into Track 3 Side B, One of Us Must Know (Sooner or Later) and we see him starting to accept that it was never about this woman, it was never about anything but becoming a better person. The penultimate track Joey is about  the story of the life and death of mobster Joey Gallo, who was killed on his birthday which I guess could mean its his birthday? I don't know I just think its a good fit for the 2nd to last track on a full album. And then we finally get to the final track, Love Minus Zero/No Limit. We have been thru ups and we have been thru downs and now we are accepting. We are moving on. We are Bringing It All Back Home.",
    "nameAndImageParagraph": "So now that the album is recorded, mastered and sequenced, we need a title. I think its only appropriate to name it something related to what started this whole thing: Bob Dylan's 115th Car Crash Or Whatever. As far as a cover, I saw we take a note from Self Portrait and find us a painting made by Dylan himself: A guy passed out, depressed in the bar during the day. Depressing but the color palette does breathe a bit of hopefulness in the whole thing. For the back cover, I just googled France 1970's and found this hot babe. Aooga, amirite?",
    "wrapUpparagraph": "And there ya have it. Bob Dylan - Bob Dylan's 115th Car Crash Or Whatever. Go listen or whatever.",
    "albumImageFront": "NSRC-dylan-front.png",
    "albumImageBack": "NSRC-dylan-back.png",
    "spotifyPlaylistLink": "https://open.spotify.com/embed/playlist/7GnMopY9VGAUJYT7uFolRR?utm_source=generator"
  },
  {
    "id": 3,
    "nsrcListing": "0003-NSRC",
    "artistEntry": "(Various Artists) Porchwave",
    "imageOne": "NSRC-porchwave-image.jpg",
    "introParagraph": "I always liked it when record labels would put out compilations of songs from the variety of artists on their label. Epitaphs Punk-O-Rama certainly come to mind and if you are an aging millennial, I am sure you had plenty of experience with those bad boys. So I figured, since I am posing as a real record label when in actuality I am a guy who just really likes music a little, I might as well put out a various artists compilation. You gotta really lean into your delusions around here. And since we are at the end of Spring and going into Summer, I figured a comp filled with smooth, chill and wavy music to sit on a porch to would be an apt fit for the first ever No Static Records Compilation. Since normally with these sort of lists I regulate myself to 10 tracks for one singular artist, I figured for the sake of variety overall, I would double that to 20 songs. And since I mentioned Punk-O-Rama, I suppose the best format for this would be Compact Disc or in layman's parlance, a CD.",
    "sideOneParagraph": "The first track, I wanted to get a nice steady intro to ease the listener into the sound of smooth, chill and wavy. I always liked this OST I found for this movie I have never seen called Flinch. There is a short Tangerine Dream-esque track on it called The Girl. It's a cool 1 minute and 11 seconds and a nice place setter. Then, right into the chillwave masterpiece Fool It All Around by Washed Out. If you don't know Washed Out but have seen the show Portlandia, then you at least know this track. I would like to lead to a specific mood after this. I want a couple of tracks with driving beats to get the blood pumping so a couple tracks from Men I Trust and TOPS should do just fine. Then, let's run it thru the garden of jazz adjacent, feel good killers. Thundercat with Kenny Loggins and Michael McDonald, Sade, George Benson (you know its gonna be Breezin) and then end that run with the Sophisti-Pop/Jazz artist and all-around underrated talent, The Blue Nile.",
    "sideTwoParagraph": "To switch gears a bit, I want to throw us next to my personal favorite Real Estate song Wonder Years then lead us down a path where we meet a couple of wavy guys named Four Tet and Teen Daze. Now you don't know which way you're going but I bet you are chillin, huh. Then, let's throw it to a couple of kings of setting a smooth temperature, Donald Fagen, Dijon and a buried classic by Michael McDonald.",
    "nameAndImageParagraph": "Then, the nighttime driving kings and queen Chromatics put us in a trance for a bit only to lead us into the final run. For the last 5 tracks, I don't want to rely on the traditional vocal leads you would expect from your normal fare of songs. So, I am going with a Clams Casino classic, the spacy Boards of Canada, the just weird enough Mid-Air Thief, an Air track (holy shit Moon Safari still holds up, might have to essential that bad boy) and end us off with I Set My Face to the Hillside by Tortoise.",
    "wrapUpparagraph": "And thar she blows! The first ever No Static Records compliation. Enjoy it with a drink and a nice breeze. You've earned it.",
    "albumImageFront": "NSRC-porchwave-front.png",
    "albumImageBack": "NSRC-porchwave-back.png",
    "spotifyPlaylistLink": "https://open.spotify.com/embed/playlist/6QknDrzyoWUnnmxjXjFpDL?utm_source=generator"
  },
  {
    "id": 4,
    "nsrcListing": "0004-NSRC",
    "artistEntry": "Minus The Bear",
    "imageOne": "NSRC-mtb.jpg",
    "introParagraph": "Everyone has those albums, artists, and songs that shaped their younger years unless you are one of those weirdos who doesn't listen to music. In that case, you can substitute music with, I don't know, animals you killed as a 7-year-old or something. If you threw all of the artists that you liked from ages 10 to 20, I wonder how many of those artists do you think made you who you are today? Now, how many of those artists can you still listen to today without the filter of nostalgia? If you're like me, you probably threw about 70% of those artists away. But that's life. You grow, learn to appreciate new things, and whatever sticks around, sticks around. But it's an impressive feat for an artist to stay with you for so long like Minus the Bear has for me. Introduced to me when I was 18 years old by my friend Allie and now, at the ripe old age of 82 years, I still come back to them again and again. The end is the beginning is the end. On the surface, they are a math rock band that sings about buying yachts and kissing girls and while that's almost the case, they were masters at sequencing a proverbial mountain range of tempos, sonic ideas, and moods. What would happen if we tried to make a Minus the Bear album that retained the same momentum throughout? Maybe something you could play while sailing around on your new yacht.",
    "sideOneParagraph": "Sadly, I won't be including anything after Planet Of Ice on this. Into the Mirror and Invisible nearly made the cut but a lot of MTB's sound and production got slightly sleeker and a bit more 'cold' after Planet of Ice. Even Planet of Ice starts to showcase said coldness on most tracks. This is not a criticism of their later records in any way but if I am going to put together something that retains a specific momentum and feeling throughout, I am going to have to be a bit more strict on where the songs come from and since I prefer pre-They Make Beer Commercials Like This MTB, I am going to go with that. Normally, when putting together one of these, I try to find an opener that isn't normally an opener on one of the albums in real life but 'Thanks For the Killer Game of Crisco Twister' is too perfect of an album opener that I have to replicate its kick-down-the-door entrance. For the second track, I am going with something that matches about the same tempo and lightness as 'Thanks For The Killer Game...' and I wanted to showcase their first few EPs in some way. I have always thought MTB has a killer EP game so the second track is the very MySpace/Random XD sounding song 'Hey! Is That a Ninja Up There?' For the third track, I was going to go with 'Memphis & 53rd' but it seemed a bit too on the dark and ominous side for what I want to convey here so instead, I'm going with 'Drilling,' which still talks of coastlines and waterfronts that these fools love singing about so much but also tightens up the theme to give the track sequencing a bit more punch. This only serves for a release and re-catch, if you will, on the fourth track with 'Throwin' Shapes.' The opening seconds on this one seem loose and free but the song once again tightens up and punches back just a bit. To loosen up the tension and because you have to put the best MTB song on this album, I am going with the fifth track and side A closer 'Pachuca Sunrise.' Look, I don't expect you to go along with this every step of the way but if you do anything while reading this godforsaken mess of a write-up, please do it while listening to 'Pachuca Sunrise.' It's an achievement very few artists ever reach.",
    "sideTwoParagraph": "For the first and second track on Side B, I wanted to reintroduce what this album is all about by showcasing one of the smoothest track-into-track moments in MTB's career with 'Intro' into 'Just Kickin' It Like a Wild Donkey' off of their first EP This Is What I Know About Being Gigantic. It was too clutch not to include and luckily the combo pairs very nicely with the third track on Side B, 'Get Me Naked 2: Electric Boogaloo.' This is me letting off the gas just a little bit. We have been cruising on the yacht at a good speed for a number of minutes and sometimes it's nice to slow down a bit, crack a beer and look at the sunset. But you have an 'Absinthe Party at the Fly Honey Warehouse' to get to so for the penultimate track, I have 'Absinthe Party at the Fly Honey Warehouse.' Now for an album finisher, I was going to go with something like 'Dr. L'Ling,' 'Let's Play Guitar in a Five Guitar Band,' or 'Lotus'... something that would end the album in a big moment. But after trying these songs out, it didn't feel right. So I wanted to keep the party going to the very end with 'Houston, We Have Uh-Oh.' And if the party is still going on deep into the night, you can always loop back around. The end is the beginning is the end.",
    "nameAndImageParagraph": "For the album art, I found this old black and white photo of two gals on a boat. One is pouring what looks like coffee from a thermos and the other is holding a banana. It locks in the boating theme but also just a splash of nostalgia bait to make you feel real good inside as if this album is both from the past and the future. The end is the beginning is the end. Now for an album title, I am not quite sure what direction to go in. Their EPs have ridiculous names, Highly Refined Pirates is an S tier title, and Menos El Oso is just their band name in Spanish. Outside of those titles, their album names haven't been too standout-ish. So I am just going to lift a line said a couple of times from 'Absinthe Party' for the title: Two Star Hotel. When you're young and broke, who cares about your temporary living quarters? A two-star hotel is fine enough because most of my time will be spent drunk on a boat.",
    "wrapUpparagraph": "We did it. Now go enjoy your day or else.",
    "albumImageFront": "NSRC-mtb-front.png",
    "albumImageBack": "NSRC-mtb-back.png",
    "spotifyPlaylistLink": "https://open.spotify.com/embed/playlist/2rmpP08zlfuKb1vX9fXZxJ?utm_source=generator"
  },
  {
    "id": 5,
    "nsrcListing": "0005-NSRC",
    "artistEntry": "(Various Artists) Business Rock",
    "imageOne": "NSRC-bizrock.jpg",
    "introParagraph": "The best ideas in life are created when talking with a like minded guy and I have proof. So I imagine you have heard of Yacht Rock but if not, it's a subgenre of music that was previlant in the late 70s to the early 80s. The likes of Steely Dan, Michael McDonald, Kenny Loggins and more make up this wonderful classification of music but at the time, it wasn't known as Yacht Rock. That name was coined by the incredibly funny guys responsible for the Channel 101 (now on YouTube) series of the same name Yacht Rock. Since then, laymen have tried to assert that certain songs and artists are Yacht Rock when in fact, they are just finding something that sounds mellow enough to listen to on a boat or drink a fruity frozen beverage to. ",
    "sideOneParagraph": "It's the nature of a good idea: people are going to ineveitably miusunderstand it and try to run their own ideas against it. Thats exactly what I want to happen to the newest coined subgenre created by myself and like-minded guy and best pal of 30 plus years TJ. What started as an off handed joke between us blossomed into an idea and with that idea will sprout a massive sensation. Sooner or later, plently of casuals (get it? because Business or Casual?) will be trying to label some Beck song or something as a Business Rock song. ",
    "sideTwoParagraph": "I guess I should give you a rundown of the genre before I continue: If a song has an 80's rockin' sound and if you can imagine an 80's business man (or woman, no sexism in this chat) listening to this song in a high rise on a Friday while talking business on a landline while looking deeply at a sunset, then it might be business rock. If you can imagine even further this song being played ad nausem in a fancy red droptop while driving to a business meeting, then it might be a Business Rock song. If your imagination can move even further into the bullpin of business related acumen, if this song sounds like maybe what a rolled up suit sleeve sounds like and if the man (or woman oh my god dude don't assume) in that suit is responsible for shortening Business to 'Biz' because its the most straight to Business thing to do when you are busy with business, then it probably is most definitely Business Rock.",
    "nameAndImageParagraph": "What you have before you is  a collection of 18 tracks from the busiest little beavers in the world making some of the most rockin' to the point 80s tunes that have ever existed. Are you someone who needs something to slam a rail off of a mirror before asking your boss for a raise? Well, this comp is for you. Are you someone who says they are adventurous foodies but in reality, just says they like sushi and curry based meals while eating a burger 5 times a week, then this comp is for you. If you fucking LOVE speadsheets and buy sell buy sell... well, then you NEED this comp for your next all hands meeting. It is going to pump your staff up so much that you'll be purchasing the mansion next to your mansion just to tear it down and build up a new pool for your unloving wife (OR HUSBNAD) and ungrateful kids.",
    "wrapUpparagraph": "It's time to ditch that mellow crap you have been playing on your way to work and get the good stuff. It's time to get to Business.",
    "albumImageFront": "NSRC-biz-front.png",
    "albumImageBack": "NSRC-biz-back.png",
    "spotifyPlaylistLink": "https://open.spotify.com/embed/playlist/1xr0YpAtkr4ekBfAL7xb9z?utm_source=generator"
  }
]
